uni/informatik/xml/quickguides.org
#+Latex_Header: \usepackage[T1]{fontenc}
#+Latex_Header: \usepackage{t1enc}
#+Latex_Header: \linespread{1.0}
#+Latex_Header: \usepackage[left=1.5cm,right=1.5cm,top=1.5cm,bottom=1.5cm]{geometry}
# Paragraph indentation
#+Latex_Header: \setlength{\parindent}{0in}
# Paragraph spacing
#+Latex_Header: \setlength{\parskip}{0.15cm}
* DTD
A DTD is a Document Type Definition and defines the structure & the legal elements & attributes of an XML document. By using a DTD independent groups of people can agree on a standard DTD for interchanging data. An application can use a DTD to verify that XML data is valid.\\
A DTD can be declared inside an XML file or in an external file.
Internal:
#+BEGIN_SRC xml
<?xml version="1.0"?>
<!DOCTYPE note [
<!ELEMENT note (to,from,heading,body)>
<!ELEMENT to (#PCDATA)>
<!ELEMENT from (#PCDATA)>
<!ELEMENT heading (#PCDATA)>
<!ELEMENT body (#PCDATA)>
]>
<note>
  <to>Tove</to>
  <from>Jani</from>
  <heading>Reminder</heading>
  <body>Don't forget me this weekend</body>
</note>
#+END_SRC
External:
#+BEGIN_SRC xml
<?xml version="1.0"?>
<!DOCTYPE note SYSTEM "note.dtd">
<note>
  <to>Tove</to>
  <from>Jani</from>
  <heading>Reminder</heading>
  <body>Don't forget me this weekend!</body>
</note>
#+END_SRC
note.dtd:
#+BEGIN_SRC xml
<!ELEMENT note (to,from,heading,body)>
<!ELEMENT to (#PCDATA)>
<!ELEMENT from (#PCDATA)>
<!ELEMENT heading (#PCDATA)>
<!ELEMENT body (#PCDATA)>
#+END_SRC
Seen from a DTD point of view, all XML documents are made up by the following building blocks:
- Elements =  main building blocks
- Attributes = provide extra information about elements
- Entities = some characters in XML have a special meaning, entities are expanded when a document is parsed by an XML parser
- PCDATA = parsed character data (text that will be examined by the parser for entities & markup)
- CDATA = character data that will not be parsed and expanded by a parser

