uni/informatik/xml/quickguides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-10 Mon 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="eo shiru" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b165c9">1. DTD S.1</a>
<ul>
<li><a href="#org785706f">1.1. Elements S.2</a></li>
<li><a href="#org5fff2b9">1.2. Attributes S.2</a></li>
<li><a href="#org3317575">1.3. Entities S.4</a></li>
</ul>
</li>
<li><a href="#orgeb0137f">2. XML Schema S.4</a>
<ul>
<li><a href="#org3b3d6df">2.1. Simple Elements S.5</a></li>
<li><a href="#org20d3984">2.2. Attributes S.5</a></li>
<li><a href="#org1202faf">2.3. Restrictions S.6</a></li>
<li><a href="#orgf047422">2.4. Complex Elements S.7</a>
<ul>
<li><a href="#orgc00a5d9">2.4.1. Indicators S.8</a></li>
<li><a href="#org283f54b">2.4.2. Misc S.10</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8867976">3. XSLT S.10</a>
<ul>
<li><a href="#org7fc0dfa">3.1. Basics S.10</a></li>
<li><a href="#orgcb24844">3.2. Template Example S.11</a></li>
</ul>
</li>
<li><a href="#orgd1325c5">4. XPath Reference S.12</a>
<ul>
<li><a href="#org6690cdb">4.1. Selecting nodes S.12</a></li>
<li><a href="#org388a052">4.2. Predicates S.13</a></li>
<li><a href="#org970483f">4.3. Selecting unknown nodes S.13</a></li>
</ul>
</li>
<li><a href="#org75d74e3">5. RDF S.13</a>
<ul>
<li><a href="#orgcbb7e13">5.1. RDF/XML S.14</a></li>
<li><a href="#org80fd54b">5.2. RDF Schema S.14</a></li>
</ul>
</li>
<li><a href="#org17f3157">6. SPARQL S.15</a>
<ul>
<li><a href="#orgc29a895">6.1. SPARQL Examples S.15</a></li>
</ul>
</li>
<li><a href="#org1db16c5">7. OWL by Erfan S.16</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4b165c9" class="outline-2">
<h2 id="org4b165c9"><span class="section-number-2">1</span> DTD</h2>
<div class="outline-text-2" id="text-1">
<p>
A DTD is a Document Type Definition and defines the structure &amp; the legal elements &amp; attributes of an XML document. By using a DTD independent groups of people can agree on a standard DTD for interchanging data. An application can use a DTD to verify that XML data is valid.<br />
A DTD can be declared inside an XML file or in an external file.
Internal:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;
&lt;!DOCTYPE note [
&lt;!ELEMENT note (to,from,heading,body)&gt;
&lt;!ELEMENT to (#PCDATA)&gt;
&lt;!ELEMENT from (#PCDATA)&gt;
&lt;!ELEMENT heading (#PCDATA)&gt;
&lt;!ELEMENT body (#PCDATA)&gt;
]&gt;
&lt;<span style="color: #b58900;">note</span>&gt;
  &lt;<span style="color: #b58900;">to</span>&gt;Tove&lt;/<span style="color: #b58900;">to</span>&gt;
  &lt;<span style="color: #b58900;">from</span>&gt;Jani&lt;/<span style="color: #b58900;">from</span>&gt;
  &lt;<span style="color: #b58900;">heading</span>&gt;Reminder&lt;/<span style="color: #b58900;">heading</span>&gt;
  &lt;<span style="color: #b58900;">body</span>&gt;Don't forget me this weekend&lt;/<span style="color: #b58900;">body</span>&gt;
&lt;/<span style="color: #b58900;">note</span>&gt;
</pre>
</div>
<p>
External:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;
&lt;!DOCTYPE note SYSTEM "note.dtd"&gt;
&lt;<span style="color: #b58900;">note</span>&gt;
  &lt;<span style="color: #b58900;">to</span>&gt;Tove&lt;/<span style="color: #b58900;">to</span>&gt;
  &lt;<span style="color: #b58900;">from</span>&gt;Jani&lt;/<span style="color: #b58900;">from</span>&gt;
  &lt;<span style="color: #b58900;">heading</span>&gt;Reminder&lt;/<span style="color: #b58900;">heading</span>&gt;
  &lt;<span style="color: #b58900;">body</span>&gt;Don't forget me this weekend!&lt;/<span style="color: #b58900;">body</span>&gt;
&lt;/<span style="color: #b58900;">note</span>&gt;
</pre>
</div>
<p>
note.dtd:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;!ELEMENT note (to,from,heading,body)&gt;
&lt;!ELEMENT to (#PCDATA)&gt;
&lt;!ELEMENT from (#PCDATA)&gt;
&lt;!ELEMENT heading (#PCDATA)&gt;
&lt;!ELEMENT body (#PCDATA)&gt;
</pre>
</div>
<p>
Seen from a DTD point of view, all XML documents are made up by the following building blocks:
</p>
<ul class="org-ul">
<li>Elements =  main building blocks</li>
<li>Attributes = provide extra information about elements</li>
<li>Entities = some characters in XML have a special meaning, entities are expanded when a document is parsed by an XML parser</li>
<li>PCDATA = parsed character data (text that will be examined by the parser for entities &amp; markup)</li>
<li>CDATA = character data that will not be parsed and expanded by a parser</li>
</ul>
</div>
