uni/informatik/xml/quickguides.tex
% Created 2020-02-10 Mon 11:42
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{listings}
\usepackage[T1]{fontenc}
\usepackage{t1enc}
\linespread{1.0}
\usepackage[left=1.5cm,right=1.5cm,top=1.5cm,bottom=1.5cm]{geometry}
\setlength{\parindent}{0in}
\setlength{\parskip}{0.15cm}
\author{eo shiru}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={eo shiru},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{DTD}
\label{sec:org2aec312}
A DTD is a Document Type Definition and defines the structure \& the legal elements \& attributes of an XML document. By using a DTD independent groups of people can agree on a standard DTD for interchanging data. An application can use a DTD to verify that XML data is valid.\\
A DTD can be declared inside an XML file or in an external file.
Internal:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>
<!DOCTYPE note [
<!ELEMENT note (to,from,heading,body)>
<!ELEMENT to (#PCDATA)>
<!ELEMENT from (#PCDATA)>
<!ELEMENT heading (#PCDATA)>
<!ELEMENT body (#PCDATA)>
]>
<note>
  <to>Tove</to>
  <from>Jani</from>
  <heading>Reminder</heading>
  <body>Don't forget me this weekend</body>
</note>
\end{lstlisting}
External:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>
<!DOCTYPE note SYSTEM "note.dtd">
<note>
  <to>Tove</to>
  <from>Jani</from>
  <heading>Reminder</heading>
  <body>Don't forget me this weekend!</body>
</note>
\end{lstlisting}
note.dtd:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<!ELEMENT note (to,from,heading,body)>
<!ELEMENT to (#PCDATA)>
<!ELEMENT from (#PCDATA)>
<!ELEMENT heading (#PCDATA)>
<!ELEMENT body (#PCDATA)>
\end{lstlisting}
Seen from a DTD point of view, all XML documents are made up by the following building blocks:
\begin{itemize}
\item Elements =  main building blocks
\item Attributes = provide extra information about elements
\item Entities = some characters in XML have a special meaning, entities are expanded when a document is parsed by an XML parser
\item PCDATA = parsed character data (text that will be examined by the parser for entities \& markup)
\item CDATA = character data that will not be parsed and expanded by a parser
\end{itemize}
