uni/informatik/xml/quickguides.org
** Elements
- declared via =<!ELEMENT element-name category>= or =<!ELEMENT element-name (element-content)>=
- empty elements are declared with the category keyword EMPTY, eg: =<!ELEMENT br EMPTY>= \rightarrow =<br />=
- elements with only parsed character data are declared with #PCDATA inside parantheses, eg: =<!ELEMENT recipient (#PCDATA)>=
- elements declared with the category keyword ANY, can contain any combination of parsable data, eg: =<!ELEMENT note ANY>=
- elements with one more children are declared with the name of the children elements inside parantheses, eg: =<!ELEMENT elem-name (child1, child2,...)=
  - when children are declared in such a sequence separated by commas, the children /must appear in the same sequence (order)/ in the document
  - in a full declaration the children must also be declared, and the children can also have children, eg: 
  #+BEGIN_SRC xml
  <!ELEMENT note (to,from,heading,body)>
  <!ELEMENT to (#PCDATA)>
  <!ELEMENT from (#PCDATA)>
  <!ELEMENT heading (#PCDATA)>
  <!ELEMENT body (#PCDATA)>
  #+END_SRC
- declaring only one exact occurence of an elment: =<!ELEMENT note (message)>=
- declaring minimum one (or more) occurence of an element: =<!ELEMENT note (message+)=
- declaring zero or more occurences of an element: =<!ELEMENT note (message*)>=
- declaring zero or one occurence of an element: =<!ELEMENT note (message?)>=
- declaring either/or content: =<!ELEMENT note (to,from,header,(message|body))>= declares that the "note" element must contain a 'to', 'from', 'header' element and either a 'message' or a 'body' element
- declaring mixed content: =<!ELEMENT note (#PCDATA|to|from|header|message)*>= declares that the "note" element can contain zero or more occurrences of parsed character data, "to", "from", "header", or "message" elements

