uni/informatik/xml/quickguides.html

<div id="outline-container-org785706f" class="outline-3">
<h3 id="org785706f"><span class="section-number-3">1.1</span> Elements</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>declared via <code>&lt;!ELEMENT element-name category&gt;</code> or <code>&lt;!ELEMENT element-name (element-content)&gt;</code></li>
<li>empty elements are declared with the category keyword EMPTY, eg: <code>&lt;!ELEMENT br EMPTY&gt;</code> &rarr; <code>&lt;br /&gt;</code></li>
<li>elements with only parsed character data are declared with #PCDATA inside parantheses, eg: <code>&lt;!ELEMENT recipient (#PCDATA)&gt;</code></li>
<li>elements declared with the category keyword ANY, can contain any combination of parsable data, eg: <code>&lt;!ELEMENT note ANY&gt;</code></li>
<li><p>
elements with one more children are declared with the name of the children elements inside parantheses, eg: <code>&lt;!ELEMENT elem-name (child1, child2,...)</code>
</p>
<ul class="org-ul">
<li>when children are declared in such a sequence separated by commas, the children <i>must appear in the same sequence (order)</i> in the document</li>
<li>in a full declaration the children must also be declared, and the children can also have children, eg:</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;!ELEMENT note (to,from,heading,body)&gt;
&lt;!ELEMENT to (#PCDATA)&gt;
&lt;!ELEMENT from (#PCDATA)&gt;
&lt;!ELEMENT heading (#PCDATA)&gt;
&lt;!ELEMENT body (#PCDATA)&gt;
</pre>
</div></li>
<li>declaring only one exact occurence of an elment: <code>&lt;!ELEMENT note (message)&gt;</code></li>
<li>declaring minimum one (or more) occurence of an element: <code>&lt;!ELEMENT note (message+)</code></li>
<li>declaring zero or more occurences of an element: <code>&lt;!ELEMENT note (message*)&gt;</code></li>
<li>declaring zero or one occurence of an element: <code>&lt;!ELEMENT note (message?)&gt;</code></li>
<li>declaring either/or content: <code>&lt;!ELEMENT note (to,from,header,(message|body))&gt;</code> declares that the "note" element must contain a 'to', 'from', 'header' element and either a 'message' or a 'body' element</li>
<li>declaring mixed content: <code>&lt;!ELEMENT note (#PCDATA|to|from|header|message)*&gt;</code> declares that the "note" element can contain zero or more occurrences of parsed character data, "to", "from", "header", or "message" elements</li>
</ul>
</div>
</div>
