uni/informatik/xml/quickguides.tex

\subsection{Elements}
\label{sec:org511faaa}
\begin{itemize}
\item declared via \texttt{<!ELEMENT element-name category>} or \texttt{<!ELEMENT element-name (element-content)>}
\item empty elements are declared with the category keyword EMPTY, eg: \texttt{<!ELEMENT br EMPTY>} \(\rightarrow\) \texttt{<br />}
\item elements with only parsed character data are declared with \#PCDATA inside parantheses, eg: \texttt{<!ELEMENT recipient (\#PCDATA)>}
\item elements declared with the category keyword ANY, can contain any combination of parsable data, eg: \texttt{<!ELEMENT note ANY>}
\item elements with one more children are declared with the name of the children elements inside parantheses, eg: \texttt{<!ELEMENT elem-name (child1, child2,...)}
\begin{itemize}
\item when children are declared in such a sequence separated by commas, the children \emph{must appear in the same sequence (order)} in the document
\item in a full declaration the children must also be declared, and the children can also have children, eg:
\end{itemize}
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<!ELEMENT note (to,from,heading,body)>
<!ELEMENT to (#PCDATA)>
<!ELEMENT from (#PCDATA)>
<!ELEMENT heading (#PCDATA)>
<!ELEMENT body (#PCDATA)>
\end{lstlisting}
\item declaring only one exact occurence of an elment: \texttt{<!ELEMENT note (message)>}
\item declaring minimum one (or more) occurence of an element: \texttt{<!ELEMENT note (message+)}
\item declaring zero or more occurences of an element: \texttt{<!ELEMENT note (message*)>}
\item declaring zero or one occurence of an element: \texttt{<!ELEMENT note (message?)>}
\item declaring either/or content: \texttt{<!ELEMENT note (to,from,header,(message|body))>} declares that the "note" element must contain a 'to', 'from', 'header' element and either a 'message' or a 'body' element
\item declaring mixed content: \texttt{<!ELEMENT note (\#PCDATA|to|from|header|message)*>} declares that the "note" element can contain zero or more occurrences of parsed character data, "to", "from", "header", or "message" elements
\end{itemize}
