uni/informatik/xml/quickguides.org
** Attributes
In a DTD, attributes declared with an ATTLIST declaration, which has the following syntax: =<!ATTLIST element-name attribute-name attribute-type attribute-value>= for example =<!ATTLIST payment type CDATA "check">= \rightarrow =<payment type="check">=\\
The *attribute type* can be one of the following:
| Type                     | Description                            |
|--------------------------+----------------------------------------|
| CDATA                    | value is character data                |
| (en1\vert{}en2\vert{}..) | value must be one from enumerated list |
| ID                       | value is a unique id                   |
| IDREF                    | value is id of another element         |
| IDREFS                   | value is a list other ids              |
| NMTOKEN                  | value is a valid XML name              |
| NMTOKENS                 | value is a list of valid XML names     |
| ENTITY                   | value is an entity                     |
| ENTITIES                 | value is a list of entities            |
| NOTATION                 | value is a name of a notation          |
| xml:                     | value is a predefined xml value        |
The *attribute value* can be one of the following:
| Value          | Explanation                    |
|----------------+--------------------------------|
| /value/        | default value of the attribute |
| #REQUIRED      | attribute is required          |
| #IMPLIED       | attribute is optional          |
| #FIXED /value/ | attribute value is fixed       |

Examples:

A default attribute value
#+BEGIN_SRC xml
DTD:
<!ELEMENT square EMPTY>
<!ATTLIST square width CDATA "0">
Valid XML:
<square width="100"/>
#+END_SRC
- in the above example, "square" is defined to be an empty element with a 'width' attribute of type CDATA and a default value of 0 if no width is specified

A required attribute value
#+BEGIN_SRC xml
DTD:
<!ATTLIST person number CDATA #REQUIRED>
Valid XML:
<person number="5677" />
Invalid XML:
<person />
#+END_SRC
- use the #REQUIRED keyword if you don't have an option for a default value, but still want to force the attribute to be present.

An implied attribute value
#+BEGIN_SRC xml
DTD:
<!ATTLIST contact fax CDATA #IMPLIED>
Valid XML:
<contact fax="555-667788" />
Valid XML:
<contact />
#+END_SRC
- use the #IMPLIED keyword if you don't want to force the author to include an attribute, and you don't have an option for a default value
  
A fixed attribute value
#+BEGIN_SRC xml
DTD:
<!ATTLIST sender company CDATA #FIXED "Microsoft">
Valid XML:
<sender company="Microsoft" />
Invalid XML:
<sender company="W3Schools" />
#+END_SRC
- use the #FIXED keyword when you want an attribute to have a fixed value without allowing the author to change it. If an author includes another value, the XML parser will return an error
  
Enumerated attribute values
#+BEGIN_SRC xml
DTD:
<!ATTLIST payment type (check|cash) "cash">
XML example:
<payment type="check" />
or
<payment type="cash" />
#+END_SRC
- use enumerated attribute values when you want the attribute value to be one of a fixed set of legal values

** Entities
Entities are used to define shortcuts to special characters and can be declared internally via =<!ENTITY entity-name "entity-value">= or externally via =<!ENTITY entity-name SYSTEM "URI/URL">=\\
Example (internal):
#+BEGIN_SRC xml
DTD Example:
<!ENTITY writer "Donald Duck.">
<!ENTITY copyright "Copyright W3Schools.">
XML example:
<author>&writer;&copyright;</author>
#+END_SRC
Note: An entity has three parts: an ampersand (&), an entity name, and a semicolon (;)

Example (external):
#+BEGIN_SRC xml
DTD Example:
<!ENTITY writer SYSTEM "https://www.w3schools.com/entities.dtd">
<!ENTITY copyright SYSTEM "https://www.w3schools.com/entities.dtd">
XML example:
<author>&writer;&copyright;</author>
#+END_SRC
