uni/informatik/xml/quickguides.html

<div id="outline-container-org5fff2b9" class="outline-3">
<h3 id="org5fff2b9"><span class="section-number-3">1.2</span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In a DTD, attributes declared with an ATTLIST declaration, which has the following syntax: <code>&lt;!ATTLIST element-name attribute-name attribute-type attribute-value&gt;</code> for example <code>&lt;!ATTLIST payment type CDATA "check"&gt;</code> &rarr; <code>&lt;payment type</code>"check"&gt;=<br />
The <b>attribute type</b> can be one of the following:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CDATA</td>
<td class="org-left">value is character data</td>
</tr>

<tr>
<td class="org-left">(en1&vert;en2&vert;..)</td>
<td class="org-left">value must be one from enumerated list</td>
</tr>

<tr>
<td class="org-left">ID</td>
<td class="org-left">value is a unique id</td>
</tr>

<tr>
<td class="org-left">IDREF</td>
<td class="org-left">value is id of another element</td>
</tr>

<tr>
<td class="org-left">IDREFS</td>
<td class="org-left">value is a list other ids</td>
</tr>

<tr>
<td class="org-left">NMTOKEN</td>
<td class="org-left">value is a valid XML name</td>
</tr>

<tr>
<td class="org-left">NMTOKENS</td>
<td class="org-left">value is a list of valid XML names</td>
</tr>

<tr>
<td class="org-left">ENTITY</td>
<td class="org-left">value is an entity</td>
</tr>

<tr>
<td class="org-left">ENTITIES</td>
<td class="org-left">value is a list of entities</td>
</tr>

<tr>
<td class="org-left">NOTATION</td>
<td class="org-left">value is a name of a notation</td>
</tr>

<tr>
<td class="org-left">xml:</td>
<td class="org-left">value is a predefined xml value</td>
</tr>
</tbody>
</table>
<p>
The <b>attribute value</b> can be one of the following:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Explanation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><i>value</i></td>
<td class="org-left">default value of the attribute</td>
</tr>

<tr>
<td class="org-left">#REQUIRED</td>
<td class="org-left">attribute is required</td>
</tr>

<tr>
<td class="org-left">#IMPLIED</td>
<td class="org-left">attribute is optional</td>
</tr>

<tr>
<td class="org-left">#FIXED <i>value</i></td>
<td class="org-left">attribute value is fixed</td>
</tr>
</tbody>
</table>

<p>
Examples:
</p>

<p>
A default attribute value
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD:
&lt;!ELEMENT square EMPTY&gt;
&lt;!ATTLIST square width CDATA "0"&gt;
Valid XML:
&lt;<span style="color: #b58900;">square</span> <span style="color: #268bd2;">width</span>=<span style="color: #2aa198;">"100"</span>/&gt;
</pre>
</div>
<ul class="org-ul">
<li>in the above example, "square" is defined to be an empty element with a 'width' attribute of type CDATA and a default value of 0 if no width is specified</li>
</ul>

<p>
A required attribute value
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD:
&lt;!ATTLIST person number CDATA #REQUIRED&gt;
Valid XML:
&lt;<span style="color: #b58900;">person</span> <span style="color: #268bd2;">number</span>=<span style="color: #2aa198;">"5677"</span> /&gt;
Invalid XML:
&lt;<span style="color: #b58900;">person</span> /&gt;
</pre>
</div>
<ul class="org-ul">
<li>use the #REQUIRED keyword if you don't have an option for a default value, but still want to force the attribute to be present.</li>
</ul>

<p>
An implied attribute value
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD:
&lt;!ATTLIST contact fax CDATA #IMPLIED&gt;
Valid XML:
&lt;<span style="color: #b58900;">contact</span> <span style="color: #268bd2;">fax</span>=<span style="color: #2aa198;">"555-667788"</span> /&gt;
Valid XML:
&lt;<span style="color: #b58900;">contact</span> /&gt;
</pre>
</div>
<ul class="org-ul">
<li>use the #IMPLIED keyword if you don't want to force the author to include an attribute, and you don't have an option for a default value</li>
</ul>

<p>
A fixed attribute value
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD:
&lt;!ATTLIST sender company CDATA #FIXED "Microsoft"&gt;
Valid XML:
&lt;<span style="color: #b58900;">sender</span> <span style="color: #268bd2;">company</span>=<span style="color: #2aa198;">"Microsoft"</span> /&gt;
Invalid XML:
&lt;<span style="color: #b58900;">sender</span> <span style="color: #268bd2;">company</span>=<span style="color: #2aa198;">"W3Schools"</span> /&gt;
</pre>
</div>
<ul class="org-ul">
<li>use the #FIXED keyword when you want an attribute to have a fixed value without allowing the author to change it. If an author includes another value, the XML parser will return an error</li>
</ul>

<p>
Enumerated attribute values
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD:
&lt;!ATTLIST payment type (check|cash) "cash"&gt;
XML example:
&lt;<span style="color: #b58900;">payment</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"check"</span> /&gt;
or
&lt;<span style="color: #b58900;">payment</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"cash"</span> /&gt;
</pre>
</div>
<ul class="org-ul">
<li>use enumerated attribute values when you want the attribute value to be one of a fixed set of legal values</li>
</ul>
</div>
</div>

<div id="outline-container-org3317575" class="outline-3">
<h3 id="org3317575"><span class="section-number-3">1.3</span> Entities</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Entities are used to define shortcuts to special characters and can be declared internally via <code>&lt;!ENTITY entity-name "entity-value"&gt;</code> or externally via <code>&lt;!ENTITY entity-name SYSTEM "URI/URL"&gt;</code><br />
Example (internal):
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD Example:
&lt;!ENTITY writer "Donald Duck."&gt;
&lt;!ENTITY copyright "Copyright W3Schools."&gt;
XML example:
&lt;<span style="color: #b58900;">author</span>&gt;<span style="color: #6c71c4;">&amp;</span><span style="color: #6c71c4;">writer</span><span style="color: #6c71c4;">;&amp;</span><span style="color: #6c71c4;">copyright</span><span style="color: #6c71c4;">;</span>&lt;/<span style="color: #b58900;">author</span>&gt;
</pre>
</div>
<p>
Note: An entity has three parts: an ampersand (&amp;), an entity name, and a semicolon (;)
</p>

<p>
Example (external):
</p>
<div class="org-src-container">
<pre class="src src-xml">DTD Example:
&lt;!ENTITY writer SYSTEM "https://www.w3schools.com/entities.dtd"&gt;
&lt;!ENTITY copyright SYSTEM "https://www.w3schools.com/entities.dtd"&gt;
XML example:
&lt;<span style="color: #b58900;">author</span>&gt;<span style="color: #6c71c4;">&amp;</span><span style="color: #6c71c4;">writer</span><span style="color: #6c71c4;">;&amp;</span><span style="color: #6c71c4;">copyright</span><span style="color: #6c71c4;">;</span>&lt;/<span style="color: #b58900;">author</span>&gt;
</pre>
</div>
</div>
</div>
</div>
