uni/informatik/xml/quickguides.tex

\subsection{Attributes}
\label{sec:orgeb26731}
In a DTD, attributes declared with an ATTLIST declaration, which has the following syntax: \texttt{<!ATTLIST element-name attribute-name attribute-type attribute-value>} for example \texttt{<!ATTLIST payment type CDATA "check">} \(\rightarrow\) \texttt{<payment type}"check">=\\
The \textbf{attribute type} can be one of the following:
\begin{center}
\begin{tabular}{ll}
Type & Description\\
\hline
CDATA & value is character data\\
(en1\(\vert{}\)en2\(\vert{}\)..) & value must be one from enumerated list\\
ID & value is a unique id\\
IDREF & value is id of another element\\
IDREFS & value is a list other ids\\
NMTOKEN & value is a valid XML name\\
NMTOKENS & value is a list of valid XML names\\
ENTITY & value is an entity\\
ENTITIES & value is a list of entities\\
NOTATION & value is a name of a notation\\
xml: & value is a predefined xml value\\
\end{tabular}
\end{center}
The \textbf{attribute value} can be one of the following:
\begin{center}
\begin{tabular}{ll}
Value & Explanation\\
\hline
\emph{value} & default value of the attribute\\
\#REQUIRED & attribute is required\\
\#IMPLIED & attribute is optional\\
\#FIXED \emph{value} & attribute value is fixed\\
\end{tabular}
\end{center}

Examples:

A default attribute value
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD:
<!ELEMENT square EMPTY>
<!ATTLIST square width CDATA "0">
Valid XML:
<square width="100"/>
\end{lstlisting}
\begin{itemize}
\item in the above example, "square" is defined to be an empty element with a 'width' attribute of type CDATA and a default value of 0 if no width is specified
\end{itemize}

A required attribute value
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD:
<!ATTLIST person number CDATA #REQUIRED>
Valid XML:
<person number="5677" />
Invalid XML:
<person />
\end{lstlisting}
\begin{itemize}
\item use the \#REQUIRED keyword if you don't have an option for a default value, but still want to force the attribute to be present.
\end{itemize}

An implied attribute value
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD:
<!ATTLIST contact fax CDATA #IMPLIED>
Valid XML:
<contact fax="555-667788" />
Valid XML:
<contact />
\end{lstlisting}
\begin{itemize}
\item use the \#IMPLIED keyword if you don't want to force the author to include an attribute, and you don't have an option for a default value
\end{itemize}

A fixed attribute value
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD:
<!ATTLIST sender company CDATA #FIXED "Microsoft">
Valid XML:
<sender company="Microsoft" />
Invalid XML:
<sender company="W3Schools" />
\end{lstlisting}
\begin{itemize}
\item use the \#FIXED keyword when you want an attribute to have a fixed value without allowing the author to change it. If an author includes another value, the XML parser will return an error
\end{itemize}

Enumerated attribute values
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD:
<!ATTLIST payment type (check|cash) "cash">
XML example:
<payment type="check" />
or
<payment type="cash" />
\end{lstlisting}
\begin{itemize}
\item use enumerated attribute values when you want the attribute value to be one of a fixed set of legal values
\end{itemize}

\subsection{Entities}
\label{sec:org96b2824}
Entities are used to define shortcuts to special characters and can be declared internally via \texttt{<!ENTITY entity-name "entity-value">} or externally via \texttt{<!ENTITY entity-name SYSTEM "URI/URL">}\\
Example (internal):
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD Example:
<!ENTITY writer "Donald Duck.">
<!ENTITY copyright "Copyright W3Schools.">
XML example:
<author>&writer;&copyright;</author>
\end{lstlisting}
Note: An entity has three parts: an ampersand (\&), an entity name, and a semicolon (;)

Example (external):
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
DTD Example:
<!ENTITY writer SYSTEM "https://www.w3schools.com/entities.dtd">
<!ENTITY copyright SYSTEM "https://www.w3schools.com/entities.dtd">
XML example:
<author>&writer;&copyright;</author>
\end{lstlisting}
