uni/informatik/xml/quickguides.html
<div id="outline-container-orgeb0137f" class="outline-2">
<h2 id="orgeb0137f"><span class="section-number-2">2</span> XML Schema</h2>
<div class="outline-text-2" id="text-2">
<p>
An XML Schema describes the structure of an XML document. The XML Schema language is also referred to as XML Schema Definition (XSD).<br />
The purpose of an XML Schema is to define the legal building blocks of an XML document:
</p>
<ul class="org-ul">
<li>the elements and attributes that can appear in a document</li>
<li>the number of (and order of) child elements</li>
<li>data types for elements and attributes</li>
<li>default and fixed values for elements and attributes</li>
</ul>
<p>
One of the greatest strength of XML Schemas is the support for data types.
</p>
<ul class="org-ul">
<li>It is easier to describe allowable document content</li>
<li>It is easier to validate the correctness of data</li>
<li>It is easier to define data facets (restrictions on data)</li>
<li>It is easier to define data patterns (data formats)</li>
<li>It is easier to convert data between different data types</li>
</ul>
<p>
For example look at this simple XML doc called "note.xml":
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;
&lt;<span style="color: #b58900;">note</span>
    <span style="color: #d33682; font-style: italic;">xmlns</span>=<span style="color: #2aa198;">"https://www.w3schools.com"</span>
    <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xsi</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema-instance"</span>
    <span style="color: #d33682; font-style: italic;">xsi</span>:<span style="color: #268bd2;">schemaLocation</span>=<span style="color: #2aa198;">"https://www.w3schools.com/xml note.xsd"</span>&gt;
  &lt;<span style="color: #b58900;">to</span>&gt;Tove&lt;/<span style="color: #b58900;">to</span>&gt;
  &lt;<span style="color: #b58900;">from</span>&gt;Jani&lt;/<span style="color: #b58900;">from</span>&gt;
  &lt;<span style="color: #b58900;">heading</span>&gt;Reminder&lt;/<span style="color: #b58900;">heading</span>&gt;
  &lt;<span style="color: #b58900;">body</span>&gt;Don't forget me this weekend!&lt;/<span style="color: #b58900;">body</span>&gt;
&lt;/<span style="color: #b58900;">note</span>&gt;
</pre>
</div>
<p>
And the corresponding "note.xsd":
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;
&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">schema</span> <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xs</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema"</span>
           <span style="color: #268bd2;">targetNamespace</span>=<span style="color: #2aa198;">"https://www.w3schools.com"</span>
           <span style="color: #d33682; font-style: italic;">xmlns</span>=<span style="color: #2aa198;">"https://www.w3schools.com"</span>
           <span style="color: #268bd2;">elementFormDefault</span>=<span style="color: #2aa198;">"qualified"</span>&gt;

  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"note"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"to"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"from"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"heading"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"body"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;

&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">schema</span>&gt;
</pre>
</div>
<p>
The note element is a <b>complex type</b> because it contains other elements. The other elements (to, from, heading, body) are <b>simple types</b> because they do not contain other elements.<br />
The &lt;schema&gt; element is the root of every XML schema and often looks similar to the example above. The fragment <code>xmlns:xs="http://"xmlns:xs="http://www.w3.org/2001/XMLSchema"</code> indicates that the elements and datatypes used in the schema come from the "<a href="http://www.w3.org/2001/XMLSchema">http://www.w3.org/2001/XMLSchema</a>" namespace. It also specifies that the elements and data types that come from the "<a href="http://www.w3.org/2001/XMLSchema">http://www.w3.org/2001/XMLSchema</a>" namespace should be prefixed with <b>xs:</b><br />
The fragment <code>targetNamespace="https://www.w3schools.com"</code> indicates that the elements defined by this schema (note, to, from, heading, body) come from the "<a href="https://www.w3schools.com">https://www.w3schools.com</a>" namespace. This fragment <code>xmlns="https://www.w3schools.com"</code> indicates that the default namespace is "<a href="https://www.w3schools.com">https://www.w3schools.com</a>". Last but not least the fragment <code>elementFormDefault="qualified"</code> indicates that any elements used by the XML instance document which were declared in this schema must be namespace qualified.<br />
In the XML document the reference to the XML schema has the following fragment <code>xmlns="https://www.w3schools.com"</code> which specifies the default namespace declaration which tells the schema-validator that all the elements used in this XML document are declared in the "<a href="https://www.w3schools.com">https://www.w3schools.com</a>" namespace. Once you have the XML Schema Instance available via <code>xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"</code> the <code>schemaLocation</code> attribute can be used which has two space-separated values which indicate the namespace to use and the location of the XML schema to use for that namespace: <code>xsi:schemaLocation="https://www.w3schools.com note.xsd"</code>
</p>
</div>
