uni/informatik/xml/quickguides.tex
\section{XML Schema}
\label{sec:orged73bbf}
An XML Schema describes the structure of an XML document. The XML Schema language is also referred to as XML Schema Definition (XSD).\\
The purpose of an XML Schema is to define the legal building blocks of an XML document:
\begin{itemize}
\item the elements and attributes that can appear in a document
\item the number of (and order of) child elements
\item data types for elements and attributes
\item default and fixed values for elements and attributes
\end{itemize}
One of the greatest strength of XML Schemas is the support for data types.
\begin{itemize}
\item It is easier to describe allowable document content
\item It is easier to validate the correctness of data
\item It is easier to define data facets (restrictions on data)
\item It is easier to define data patterns (data formats)
\item It is easier to convert data between different data types
\end{itemize}
For example look at this simple XML doc called "note.xml":
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>
<note
    xmlns="https://www.w3schools.com"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="https://www.w3schools.com/xml note.xsd">
  <to>Tove</to>
  <from>Jani</from>
  <heading>Reminder</heading>
  <body>Don't forget me this weekend!</body>
</note>
\end{lstlisting}
And the corresponding "note.xsd":
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema"
           targetNamespace="https://www.w3schools.com"
           xmlns="https://www.w3schools.com"
           elementFormDefault="qualified">

  <xs:element name="note">
    <xs:complexType>
      <xs:sequence>
        <xs:element name="to" type="xs:string"/>
        <xs:element name="from" type="xs:string"/>
        <xs:element name="heading" type="xs:string"/>
        <xs:element name="body" type="xs:string"/>
      </xs:sequence>
    </xs:complexType>
  </xs:element>

</xs:schema>
\end{lstlisting}
The note element is a \textbf{complex type} because it contains other elements. The other elements (to, from, heading, body) are \textbf{simple types} because they do not contain other elements.\\
The <schema> element is the root of every XML schema and often looks similar to the example above. The fragment \texttt{xmlns:xs="http://"xmlns:xs="http://www.w3.org/2001/XMLSchema"} indicates that the elements and datatypes used in the schema come from the "\url{http://www.w3.org/2001/XMLSchema}" namespace. It also specifies that the elements and data types that come from the "\url{http://www.w3.org/2001/XMLSchema}" namespace should be prefixed with \textbf{xs:}\\
The fragment \texttt{targetNamespace="https://www.w3schools.com"} indicates that the elements defined by this schema (note, to, from, heading, body) come from the "\url{https://www.w3schools.com}" namespace. This fragment \texttt{xmlns="https://www.w3schools.com"} indicates that the default namespace is "\url{https://www.w3schools.com}". Last but not least the fragment \texttt{elementFormDefault="qualified"} indicates that any elements used by the XML instance document which were declared in this schema must be namespace qualified.\\
In the XML document the reference to the XML schema has the following fragment \texttt{xmlns="https://www.w3schools.com"} which specifies the default namespace declaration which tells the schema-validator that all the elements used in this XML document are declared in the "\url{https://www.w3schools.com}" namespace. Once you have the XML Schema Instance available via \texttt{xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"} the \texttt{schemaLocation} attribute can be used which has two space-separated values which indicate the namespace to use and the location of the XML schema to use for that namespace: \texttt{xsi:schemaLocation="https://www.w3schools.com note.xsd"}
