uni/informatik/xml/quickguides.org
** Simple Elements
A simple element is an XML element that contains only text. It cannot contain any other elements or attributes. However, the "only text" restriction is quite misleading. The text can be of many different types. It can be one of the types included in the XML Schema definition (boolean, string, date, etc.), or it can be a custom type that you can define yourself.
You can also add restrictions (facets) to a data type in order to limit its content, or you can require the data to match a specific pattern.\\
This is the syntax ~<xs:element name="xxx" type="yyy"/>~ and the most common types are:
- xs:string
- xs:decimal
- xs:integer
- xs:boolean
- xs:date
- xs:time
Here are some examples:
#+BEGIN_SRC xml
<xs:element name="lastname" type="xs:string"/>
<xs:element name="age" type="xs:integer"/>
<xs:element name="dateborn" type="xs:date"/>
and the corresponding XML elements
<lastname>Refsnes</lastname>
<age>36</age>
<dateborn>1970-03-27</dateborn>
#+END_SRC
Simple elements may have a default value OR a fixed value specified.
A default value is automatically assigned to the element when no other value is specified ~<xs:element name="color" type="xs:string" default="red"/>~. A fixed value is also automatically assigned to the element, and you cannot specify another value ~<xs:element name="color" type="xs:string" fixed="red"/>~.

** Attributes
Simple elements cannot have attributes. If an element has attributes, it is considered to be of a complex type. But the attribute itself is always declared as a simple type. ~<xs:attribute name="xxx" type="yyy"/>~ for example:
#+BEGIN_SRC xml
<xs:attribute name="lang" type="xs:string"/>
<!-- and the corresponding xml -->
<lastname lang="EN">Smith</lastname>
#+END_SRC
Similar to "Simple Elements" default and fixed values are possible. However attributes are optional by default, to specify that an attribute is required use the "use" attribute: ~<xs:attribute name="lang" type="xs:string" use="required"/>~

