uni/informatik/xml/quickguides.html
<div id="outline-container-org3b3d6df" class="outline-3">
<h3 id="org3b3d6df"><span class="section-number-3">2.1</span> Simple Elements</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A simple element is an XML element that contains only text. It cannot contain any other elements or attributes. However, the "only text" restriction is quite misleading. The text can be of many different types. It can be one of the types included in the XML Schema definition (boolean, string, date, etc.), or it can be a custom type that you can define yourself.
You can also add restrictions (facets) to a data type in order to limit its content, or you can require the data to match a specific pattern.<br />
This is the syntax <code>&lt;xs:element name="xxx" type="yyy"/&gt;</code> and the most common types are:
</p>
<ul class="org-ul">
<li>xs:string</li>
<li>xs:decimal</li>
<li>xs:integer</li>
<li>xs:boolean</li>
<li>xs:date</li>
<li>xs:time</li>
</ul>
<p>
Here are some examples:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"age"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:integer"</span>/&gt;
&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"dateborn"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:date"</span>/&gt;
and the corresponding XML elements
&lt;<span style="color: #b58900;">lastname</span>&gt;Refsnes&lt;/<span style="color: #b58900;">lastname</span>&gt;
&lt;<span style="color: #b58900;">age</span>&gt;36&lt;/<span style="color: #b58900;">age</span>&gt;
&lt;<span style="color: #b58900;">dateborn</span>&gt;1970-03-27&lt;/<span style="color: #b58900;">dateborn</span>&gt;
</pre>
</div>
<p>
Simple elements may have a default value OR a fixed value specified.
A default value is automatically assigned to the element when no other value is specified <code>&lt;xs:element name="color" type="xs:string" default="red"/&gt;</code>. A fixed value is also automatically assigned to the element, and you cannot specify another value <code>&lt;xs:element name="color" type="xs:string" fixed="red"/&gt;</code>.
</p>
</div>
</div>

<div id="outline-container-org20d3984" class="outline-3">
<h3 id="org20d3984"><span class="section-number-3">2.2</span> Attributes</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Simple elements cannot have attributes. If an element has attributes, it is considered to be of a complex type. But the attribute itself is always declared as a simple type. <code>&lt;xs:attribute name="xxx" type="yyy"/&gt;</code> for example:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">attribute</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lang"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
<span style="color: #96A7A9; font-style: italic;">&lt;!-- </span><span style="color: #96A7A9; font-style: italic;">and the corresponding xml </span><span style="color: #96A7A9; font-style: italic;">--&gt;</span>
&lt;<span style="color: #b58900;">lastname</span> <span style="color: #268bd2;">lang</span>=<span style="color: #2aa198;">"EN"</span>&gt;Smith&lt;/<span style="color: #b58900;">lastname</span>&gt;
</pre>
</div>
<p>
Similar to "Simple Elements" default and fixed values are possible. However attributes are optional by default, to specify that an attribute is required use the "use" attribute: <code>&lt;xs:attribute name="lang" type="xs:string" use="required"/&gt;</code>
</p>
</div>
</div>
