uni/informatik/xml/quickguides.org
** Restrictions
Restrictions are used to define acceptable values for XML elements or attributes. Restrictions on XML elements are called facets.\\
The following example defines an element called "age" with a restriction. The value of age cannot be lower than 0 or greater than 120:
#+BEGIN_SRC xml
<xs:element name="age">
  <xs:simpleType>
    <xs:restriction base="xs:integer">
      <xs:minInclusive value="0"/>
      <xs:maxInclusive value="120"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
#+END_SRC
To limit the content of an XML element to a set of acceptable values, we would use the enumeration constraint.
The example below defines an element called "car" with a restriction. The only acceptable values are: Audi, Golf, BMW:
#+BEGIN_SRC xml
<xs:element name="car">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:enumeration value="Audi"/>
      <xs:enumeration value="Golf"/>
      <xs:enumeration value="BMW"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
#+END_SRC
The example above could also have been written like this:
#+BEGIN_SRC xml
<xs:element name="car" type="carType"/>

<xs:simpleType name="carType">
  <xs:restriction base="xs:string">
    <xs:enumeration value="Audi"/>
    <xs:enumeration value="Golf"/>
    <xs:enumeration value="BMW"/>
  </xs:restriction>
</xs:simpleType>
#+END_SRC
Note: In this case the type "carType" can be used by other elements because it is not a part of the "car" element.

To limit the content of an XML element to define a series of numbers or letters that can be used, we would use the pattern constraint.
The example below defines an element called "letter" with a restriction. The only acceptable value is ONE of the LOWERCASE letters from a to z:
#+BEGIN_SRC xml
<xs:element name="letter">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:pattern value="[a-z]"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
#+END_SRC
Other examples:
- three uppercase A-Z letters: ~<xs:pattern value="[A-Z][A-Z][A-Z]"/>~
- three upper/lowercase letter: ~<xs:pattern value="[a-zA-Z][a-zA-Z][a-zA-Z]"/>~
- one of x,y or z: ~<xs:pattern value="[xyz]"/>~
- five digits: ~<xs:pattern value="[0-9][0-9][0-9][0-9][0-9]"/>~
- zero or more occurences of lowercase letters: ~<xs:pattern value="([a-z])*"/>~
- one or more pairs of lowercase followed by uppercase letters eg sToP: ~<xs:pattern value="([a-z][A-Z])+"/>~
- only male or female: ~<xs:pattern value="male|female"/>~
- exactly eight characters in a row and those characters must be lowercase or uppercase letters from a to z, or a number from 0 to 9: ~<xs:pattern value="[a-zA-Z0-9]{8}"/>~
To specify how whitespace characters should be handled, we would use the whiteSpace constraint.
This example defines an element called "address" with a restriction. The whiteSpace constraint is set to "preserve", which means that the XML processor WILL NOT remove any white space characters:
#+BEGIN_SRC xml
<xs:element name="address">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:whiteSpace value="preserve"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
#+END_SRC
- other options would be =replace= (replaces all whitespace with space) and =collapse= (collapse to single space)
  
To limit the length of a value in an element, we would use the length (~<xs:length value="8"/>~), maxLength(~<xs:maxLength value="8"/>~), and minLength(~<xs:minLength value="5"/>~) constraints.

Additional restrictions are =fractionDigits=, =minExclusive=, =maxExclusive=, =totalDigits=.
Unique id Attribute:
#+BEGIN_SRC xml
 <xsd:element name="root" type="myList">
    <xsd:unique name="myId">
      <xsd:selector xpath="./person"/>
      <xsd:field xpath="@id"/>
    </xsd:unique>
  </xsd:element>
#+END_SRC

