uni/informatik/xml/quickguides.html

<div id="outline-container-org1202faf" class="outline-3">
<h3 id="org1202faf"><span class="section-number-3">2.3</span> Restrictions</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Restrictions are used to define acceptable values for XML elements or attributes. Restrictions on XML elements are called facets.<br />
The following example defines an element called "age" with a restriction. The value of age cannot be lower than 0 or greater than 120:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"age"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:integer"</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">minInclusive</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"0"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">maxInclusive</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"120"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
<p>
To limit the content of an XML element to a set of acceptable values, we would use the enumeration constraint.
The example below defines an element called "car" with a restriction. The only acceptable values are: Audi, Golf, BMW:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"car"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:string"</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"Audi"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"Golf"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"BMW"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
<p>
The example above could also have been written like this:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"car"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"carType"</span>/&gt;

&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"carType"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:string"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"Audi"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"Golf"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">enumeration</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"BMW"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
</pre>
</div>
<p>
Note: In this case the type "carType" can be used by other elements because it is not a part of the "car" element.
</p>

<p>
To limit the content of an XML element to define a series of numbers or letters that can be used, we would use the pattern constraint.
The example below defines an element called "letter" with a restriction. The only acceptable value is ONE of the LOWERCASE letters from a to z:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"letter"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:string"</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">pattern</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"[a-z]"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
<p>
Other examples:
</p>
<ul class="org-ul">
<li>three uppercase A-Z letters: <code>&lt;xs:pattern value="[A-Z][A-Z][A-Z]"/&gt;</code></li>
<li>three upper/lowercase letter: <code>&lt;xs:pattern value="[a-zA-Z][a-zA-Z][a-zA-Z]"/&gt;</code></li>
<li>one of x,y or z: <code>&lt;xs:pattern value="[xyz]"/&gt;</code></li>
<li>five digits: <code>&lt;xs:pattern value="[0-9][0-9][0-9][0-9][0-9]"/&gt;</code></li>
<li>zero or more occurences of lowercase letters: <code>&lt;xs:pattern value="([a-z])*"/&gt;</code></li>
<li>one or more pairs of lowercase followed by uppercase letters eg sToP: <code>&lt;xs:pattern value="([a-z][A-Z])+"/&gt;</code></li>
<li>only male or female: <code>&lt;xs:pattern value="male|female"/&gt;</code></li>
<li>exactly eight characters in a row and those characters must be lowercase or uppercase letters from a to z, or a number from 0 to 9: <code>&lt;xs:pattern value="[a-zA-Z0-9]{8}"/&gt;</code></li>
</ul>
<p>
To specify how whitespace characters should be handled, we would use the whiteSpace constraint.
This example defines an element called "address" with a restriction. The whiteSpace constraint is set to "preserve", which means that the XML processor WILL NOT remove any white space characters:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"address"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:string"</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">whiteSpace</span> <span style="color: #268bd2;">value</span>=<span style="color: #2aa198;">"preserve"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">restriction</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
<ul class="org-ul">
<li>other options would be <code>replace</code> (replaces all whitespace with space) and <code>collapse</code> (collapse to single space)</li>
</ul>

<p>
To limit the length of a value in an element, we would use the length (<code>&lt;xs:length value="8"/&gt;</code>), maxLength(<code>&lt;xs:maxLength value="8"/&gt;</code>), and minLength(<code>&lt;xs:minLength value="5"/&gt;</code>) constraints.
</p>

<p>
Additional restrictions are <code>fractionDigits</code>, <code>minExclusive</code>, <code>maxExclusive</code>, <code>totalDigits</code>.
Unique id Attribute:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"root"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"myList"</span>&gt;
   &lt;<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">unique</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"myId"</span>&gt;
     &lt;<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">selector</span> <span style="color: #268bd2;">xpath</span>=<span style="color: #2aa198;">"./person"</span>/&gt;
     &lt;<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">field</span> <span style="color: #268bd2;">xpath</span>=<span style="color: #2aa198;">"@id"</span>/&gt;
   &lt;/<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">unique</span>&gt;
 &lt;/<span style="color: #d33682; font-style: italic;">xsd</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
</div>
</div>
