uni/informatik/xml/quickguides.tex

\subsection{Restrictions}
\label{sec:orgc1c8a9c}
Restrictions are used to define acceptable values for XML elements or attributes. Restrictions on XML elements are called facets.\\
The following example defines an element called "age" with a restriction. The value of age cannot be lower than 0 or greater than 120:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="age">
  <xs:simpleType>
    <xs:restriction base="xs:integer">
      <xs:minInclusive value="0"/>
      <xs:maxInclusive value="120"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
\end{lstlisting}
To limit the content of an XML element to a set of acceptable values, we would use the enumeration constraint.
The example below defines an element called "car" with a restriction. The only acceptable values are: Audi, Golf, BMW:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="car">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:enumeration value="Audi"/>
      <xs:enumeration value="Golf"/>
      <xs:enumeration value="BMW"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
\end{lstlisting}
The example above could also have been written like this:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="car" type="carType"/>

<xs:simpleType name="carType">
  <xs:restriction base="xs:string">
    <xs:enumeration value="Audi"/>
    <xs:enumeration value="Golf"/>
    <xs:enumeration value="BMW"/>
  </xs:restriction>
</xs:simpleType>
\end{lstlisting}
Note: In this case the type "carType" can be used by other elements because it is not a part of the "car" element.

To limit the content of an XML element to define a series of numbers or letters that can be used, we would use the pattern constraint.
The example below defines an element called "letter" with a restriction. The only acceptable value is ONE of the LOWERCASE letters from a to z:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="letter">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:pattern value="[a-z]"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
\end{lstlisting}
Other examples:
\begin{itemize}
\item three uppercase A-Z letters: \texttt{<xs:pattern value="[A-Z][A-Z][A-Z]"/>}
\item three upper/lowercase letter: \texttt{<xs:pattern value="[a-zA-Z][a-zA-Z][a-zA-Z]"/>}
\item one of x,y or z: \texttt{<xs:pattern value="[xyz]"/>}
\item five digits: \texttt{<xs:pattern value="[0-9][0-9][0-9][0-9][0-9]"/>}
\item zero or more occurences of lowercase letters: \texttt{<xs:pattern value="([a-z])*"/>}
\item one or more pairs of lowercase followed by uppercase letters eg sToP: \texttt{<xs:pattern value="([a-z][A-Z])+"/>}
\item only male or female: \texttt{<xs:pattern value="male|female"/>}
\item exactly eight characters in a row and those characters must be lowercase or uppercase letters from a to z, or a number from 0 to 9: \texttt{<xs:pattern value="[a-zA-Z0-9]\{8\}"/>}
\end{itemize}
To specify how whitespace characters should be handled, we would use the whiteSpace constraint.
This example defines an element called "address" with a restriction. The whiteSpace constraint is set to "preserve", which means that the XML processor WILL NOT remove any white space characters:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="address">
  <xs:simpleType>
    <xs:restriction base="xs:string">
      <xs:whiteSpace value="preserve"/>
    </xs:restriction>
  </xs:simpleType>
</xs:element>
\end{lstlisting}
\begin{itemize}
\item other options would be \texttt{replace} (replaces all whitespace with space) and \texttt{collapse} (collapse to single space)
\end{itemize}

To limit the length of a value in an element, we would use the length (\texttt{<xs:length value="8"/>}), maxLength(\texttt{<xs:maxLength value="8"/>}), and minLength(\texttt{<xs:minLength value="5"/>}) constraints.

Additional restrictions are \texttt{fractionDigits}, \texttt{minExclusive}, \texttt{maxExclusive}, \texttt{totalDigits}.
Unique id Attribute:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xsd:element name="root" type="myList">
   <xsd:unique name="myId">
     <xsd:selector xpath="./person"/>
     <xsd:field xpath="@id"/>
   </xsd:unique>
 </xsd:element>
\end{lstlisting}
