uni/informatik/xml/quickguides.html

<div id="outline-container-orgf047422" class="outline-3">
<h3 id="orgf047422"><span class="section-number-3">2.4</span> Complex Elements</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A complex element is an XML element that contains other elements and/or attributes.
There are four kinds of complex elements:
</p>
<ul class="org-ul">
<li>empty elements</li>
<li>elements that contain only other elements</li>
<li>elements that contain only text</li>
<li>elements that contain both other elements and text</li>
</ul>
<p>
Note: Each of these elements may contain attributes as well!<br />
Example:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"employee"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"firstname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>

&lt;<span style="color: #b58900;">employee</span>&gt;
  &lt;<span style="color: #b58900;">firstname</span>&gt;John&lt;/<span style="color: #b58900;">firstname</span>&gt;
  &lt;<span style="color: #b58900;">lastname</span>&gt;Smith&lt;/<span style="color: #b58900;">lastname</span>&gt;
&lt;/<span style="color: #b58900;">employee</span>&gt;
</pre>
</div>
<ul class="org-ul">
<li><code>sequence</code> means that the elements must appear in that order inside employee</li>
</ul>

<p>
It is also possible to base a complex element on an existing complex element and add some elements:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"employee"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"fullpersoninfo"</span>/&gt;

&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"personinfo"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"firstname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;

&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"fullpersoninfo"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexContent</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">extension</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"personinfo"</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"address"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"city"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"country"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">extension</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexContent</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
</pre>
</div>

<p>
To define an empty type, define a type without declaring any elements inside it:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"prodtype"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">attribute</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"prodid"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:positiveInteger"</span>/&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
</pre>
</div>

<p>
A <b>complex text-only element</b> can contain text and attributes. This type contains only simple content (text and attributes), therefore we add a simpleContent element around the content. When using simple content, you must define an extension OR a restriction within the simpleContent element, like this:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"shoesize"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleContent</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">extension</span> <span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"xs:integer"</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">attribute</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"country"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span> /&gt;
      &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">extension</span>&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">simpleContent</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;

&lt;<span style="color: #b58900;">shoesize</span> <span style="color: #268bd2;">country</span>=<span style="color: #2aa198;">"france"</span>&gt;35&lt;/<span style="color: #b58900;">shoesize</span>&gt;
</pre>
</div>

<p>
A mixed complex type element can contain attributes, elements, and text. To enable character data to appear between the child-elements of "letter", the mixed attribute must be set to "true". The &lt;xs:sequence&gt; tag means that the elements defined (name, orderid and shipdate) must appear in that order inside a "letter" element:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"letter"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span> <span style="color: #268bd2;">mixed</span>=<span style="color: #2aa198;">"true"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"name"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"orderid"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:positiveInteger"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"shipdate"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:date"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;

&lt;<span style="color: #b58900;">letter</span>&gt;
  Dear Mr. &lt;<span style="color: #b58900;">name</span>&gt;John Smith&lt;/<span style="color: #b58900;">name</span>&gt;.
  Your order &lt;<span style="color: #b58900;">orderid</span>&gt;1032&lt;/<span style="color: #b58900;">orderid</span>&gt;
  will be shipped on &lt;<span style="color: #b58900;">shipdate</span>&gt;2001-07-13&lt;/<span style="color: #b58900;">shipdate</span>&gt;.
&lt;/<span style="color: #b58900;">letter</span>&gt;
</pre>
</div>
</div>
