uni/informatik/xml/quickguides.html

<div id="outline-container-orgc00a5d9" class="outline-4">
<h4 id="orgc00a5d9"><span class="section-number-4">2.4.1</span> Indicators</h4>
<div class="outline-text-4" id="text-2-4-1">
</div>
<ol class="org-ol">
<li><a id="orgeabd060"></a>Order Indicators<br />
<div class="outline-text-5" id="text-2-4-1-1">
<p>
Order indicators are used to define the order of the elements.
The <code>&lt;all&gt;</code> indicator specifies that the child elements can appear in any order, and that each child element must occur only once (When using the &lt;all&gt; indicator you can set the &lt;minOccurs&gt; indicator to 0 or 1 and the &lt;maxOccurs&gt; indicator can only be set to 1).<br />
The <code>&lt;choice&gt;</code> indicator specifies that either one child element or another can occur. The <code>&lt;sequence&gt;</code> indicator specifies that the child elements must appear in a specific order:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"person"</span>&gt;
   &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
   &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">all</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"firstname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">all</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">choice</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"employee"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"employee"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"member"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"member"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">choice</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"firstname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
</pre>
</div>
</div>
</li>

<li><a id="orgb64410a"></a>Occurence Indicators<br />
<div class="outline-text-5" id="text-2-4-1-2">
<p>
Occurrence indicators are used to define how often an element can occur (Note: For all "Order" and "Group" indicators (any, all, choice, sequence, group name, and group reference) the default value for maxOccurs and minOccurs is 1). The <code>&lt;maxOccurs&gt;</code> indicator specifies the maximum number of times an element can occur. The <code>&lt;minOccurs&gt;</code> indicator specifies the minimum number of times an element can occur (by default is 1).<br />
Example:<br />
family.xsd
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="UTF-8"</span>?&gt;
&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">schema</span> <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xs</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema"</span>
<span style="color: #268bd2;">elementFormDefault</span>=<span style="color: #2aa198;">"qualified"</span>&gt;

&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"persons"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"person"</span> <span style="color: #268bd2;">maxOccurs</span>=<span style="color: #2aa198;">"unbounded"</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
          &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
            &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"full_name"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
            &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"child_name"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>
            <span style="color: #268bd2;">minOccurs</span>=<span style="color: #2aa198;">"0"</span> <span style="color: #268bd2;">maxOccurs</span>=<span style="color: #2aa198;">"5"</span>/&gt;
          &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
        &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
      &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;
    &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span>&gt;

&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">schema</span>&gt;
</pre>
</div>
<p>
and family.xml
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="UTF-8"</span>?&gt;

&lt;<span style="color: #b58900;">persons</span> <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xsi</span>=<span style="color: #2aa198;">"http://www.w3.org/2001/XMLSchema-instance"</span>
<span style="color: #d33682; font-style: italic;">xsi</span>:<span style="color: #268bd2;">noNamespaceSchemaLocation</span>=<span style="color: #2aa198;">"family.xsd"</span>&gt;

&lt;<span style="color: #b58900;">person</span>&gt;
  &lt;<span style="color: #b58900;">full_name</span>&gt;Hege Refsnes&lt;/<span style="color: #b58900;">full_name</span>&gt;
  &lt;<span style="color: #b58900;">child_name</span>&gt;Cecilie&lt;/<span style="color: #b58900;">child_name</span>&gt;
&lt;/<span style="color: #b58900;">person</span>&gt;

&lt;<span style="color: #b58900;">person</span>&gt;
  &lt;<span style="color: #b58900;">full_name</span>&gt;Tove Refsnes&lt;/<span style="color: #b58900;">full_name</span>&gt;
  &lt;<span style="color: #b58900;">child_name</span>&gt;Hege&lt;/<span style="color: #b58900;">child_name</span>&gt;
  &lt;<span style="color: #b58900;">child_name</span>&gt;Stale&lt;/<span style="color: #b58900;">child_name</span>&gt;
  &lt;<span style="color: #b58900;">child_name</span>&gt;Jim&lt;/<span style="color: #b58900;">child_name</span>&gt;
  &lt;<span style="color: #b58900;">child_name</span>&gt;Borge&lt;/<span style="color: #b58900;">child_name</span>&gt;
&lt;/<span style="color: #b58900;">person</span>&gt;

&lt;<span style="color: #b58900;">person</span>&gt;
  &lt;<span style="color: #b58900;">full_name</span>&gt;Stale Refsnes&lt;/<span style="color: #b58900;">full_name</span>&gt;
&lt;/<span style="color: #b58900;">person</span>&gt;

&lt;/<span style="color: #b58900;">persons</span>&gt;
</pre>
</div>
</div>
</li>
