uni/informatik/xml/quickguides.org
**** Group Indicators
Group indicators are used to define related sets of elements which must be all, choice or sequence elements, eg:
#+BEGIN_SRC xml
<xs:group name="persongroup">
  <xs:sequence>
    <xs:element name="firstname" type="xs:string"/>
    <xs:element name="lastname" type="xs:string"/>
    <xs:element name="birthday" type="xs:date"/>
  </xs:sequence>
</xs:group>
#+END_SRC
can then be referenced in another definiton like this:
#+BEGIN_SRC xml
<xs:element name="person" type="personinfo"/>

<xs:complexType name="personinfo">
  <xs:sequence>
    <xs:group ref="persongroup"/>
    <xs:element name="country" type="xs:string"/>
  </xs:sequence>
</xs:complexType>
#+END_SRC
This is also possible for attribute groups, just replace =xs:group= with =xs:attributeGroup= and =xs:element= with =xs:attribute=.

*** Misc
The <any> element enables us to extend the XML document with elements not specified by the schema (eg ~xs:any minOccurs="0"/>~).\\
The <anyAttribute> element enables us to extend the XML document with attributes not specified by the schema (eg ~<xs:anyAttribute/>~).\\
Common data types:
- String: =string=, =ID=, =IDREF=, =language=
- Date: =date=, =dateTime=, =time=
- Numeric: =decimal=, =integer=
* XSLT
XSL (eXtensible Stylesheet Language) is a styling language for XML. XSLT stands for XSL Transformations. XSLT can be used to transform XML documents into other formats like for example HTML. XSLT 2.0, XPath 2.0, and XQuery 1.0, share the same functions library. There are over 100 built-in functions. There are functions for string values, numeric values, date and time comparison, node and QName manipulation, sequence manipulation, and more.
- *XSLT* is a language for transforming XML documents using XPath
- *XPath* is a language for navigating in XML documents
- *XQuery* is a language for querying XML documents
