uni/informatik/xml/quickguides.html


<li><a id="org07f44d5"></a>Group Indicators<br />
<div class="outline-text-5" id="text-2-4-1-3">
<p>
Group indicators are used to define related sets of elements which must be all, choice or sequence elements, eg:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">group</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"persongroup"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"firstname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"lastname"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"birthday"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:date"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">group</span>&gt;
</pre>
</div>
<p>
can then be referenced in another definiton like this:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"person"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"personinfo"</span>/&gt;

&lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"personinfo"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">group</span> <span style="color: #268bd2;">ref</span>=<span style="color: #2aa198;">"persongroup"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">element</span> <span style="color: #268bd2;">name</span>=<span style="color: #2aa198;">"country"</span> <span style="color: #268bd2;">type</span>=<span style="color: #2aa198;">"xs:string"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">sequence</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xs</span>:<span style="color: #b58900;">complexType</span>&gt;
</pre>
</div>
<p>
This is also possible for attribute groups, just replace <code>xs:group</code> with <code>xs:attributeGroup</code> and <code>xs:element</code> with <code>xs:attribute</code>.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org283f54b" class="outline-4">
<h4 id="org283f54b"><span class="section-number-4">2.4.2</span> Misc</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
The &lt;any&gt; element enables us to extend the XML document with elements not specified by the schema (eg <code>xs:any minOccurs="0"/&gt;</code>).<br />
The &lt;anyAttribute&gt; element enables us to extend the XML document with attributes not specified by the schema (eg <code>&lt;xs:anyAttribute/&gt;</code>).<br />
Common data types:
</p>
<ul class="org-ul">
<li>String: <code>string</code>, <code>ID</code>, <code>IDREF</code>, <code>language</code></li>
<li>Date: <code>date</code>, <code>dateTime</code>, <code>time</code></li>
<li>Numeric: <code>decimal</code>, <code>integer</code></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8867976" class="outline-2">
<h2 id="org8867976"><span class="section-number-2">3</span> XSLT</h2>
<div class="outline-text-2" id="text-3">
<p>
XSL (eXtensible Stylesheet Language) is a styling language for XML. XSLT stands for XSL Transformations. XSLT can be used to transform XML documents into other formats like for example HTML. XSLT 2.0, XPath 2.0, and XQuery 1.0, share the same functions library. There are over 100 built-in functions. There are functions for string values, numeric values, date and time comparison, node and QName manipulation, sequence manipulation, and more.
</p>
<ul class="org-ul">
<li><b>XSLT</b> is a language for transforming XML documents using XPath</li>
<li><b>XPath</b> is a language for navigating in XML documents</li>
<li><b>XQuery</b> is a language for querying XML documents</li>
</ul>
</div>
