uni/informatik/xml/quickguides.tex
Group indicators are used to define related sets of elements which must be all, choice or sequence elements, eg:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:group name="persongroup">
  <xs:sequence>
    <xs:element name="firstname" type="xs:string"/>
    <xs:element name="lastname" type="xs:string"/>
    <xs:element name="birthday" type="xs:date"/>
  </xs:sequence>
</xs:group>
\end{lstlisting}
can then be referenced in another definiton like this:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xs:element name="person" type="personinfo"/>

<xs:complexType name="personinfo">
  <xs:sequence>
    <xs:group ref="persongroup"/>
    <xs:element name="country" type="xs:string"/>
  </xs:sequence>
</xs:complexType>
\end{lstlisting}
This is also possible for attribute groups, just replace \texttt{xs:group} with \texttt{xs:attributeGroup} and \texttt{xs:element} with \texttt{xs:attribute}.
\end{enumerate}

\subsubsection{Misc}
\label{sec:orgb664dcd}
The <any> element enables us to extend the XML document with elements not specified by the schema (eg \texttt{xs:any minOccurs="0"/>}).\\
The <anyAttribute> element enables us to extend the XML document with attributes not specified by the schema (eg \texttt{<xs:anyAttribute/>}).\\
Common data types:
\begin{itemize}
\item String: \texttt{string}, \texttt{ID}, \texttt{IDREF}, \texttt{language}
\item Date: \texttt{date}, \texttt{dateTime}, \texttt{time}
\item Numeric: \texttt{decimal}, \texttt{integer}
\end{itemize}
\section{XSLT}
\label{sec:org61e3ca0}
XSL (eXtensible Stylesheet Language) is a styling language for XML. XSLT stands for XSL Transformations. XSLT can be used to transform XML documents into other formats like for example HTML. XSLT 2.0, XPath 2.0, and XQuery 1.0, share the same functions library. There are over 100 built-in functions. There are functions for string values, numeric values, date and time comparison, node and QName manipulation, sequence manipulation, and more.
\begin{itemize}
\item \textbf{XSLT} is a language for transforming XML documents using XPath
\item \textbf{XPath} is a language for navigating in XML documents
\item \textbf{XQuery} is a language for querying XML documents
\end{itemize}
