uni/informatik/xml/quickguides.html
<div id="outline-container-org7fc0dfa" class="outline-3">
<h3 id="org7fc0dfa"><span class="section-number-3">3.1</span> Basics</h3>
<div class="outline-text-3" id="text-3-1">
<p>
An XSL style sheet consists of one or more set of rules that are called templates. A template contains rules to apply when a specified node is matched.<br />
The <code>&lt;xsl:template&gt;</code> element is used to build templates.
The match attribute is used to associate a template with an XML element. The match attribute can also be used to define a template for the entire XML document. The value of the match attribute is an XPath expression (i.e. <code>match="/"</code> defines the whole document). Look at the previous example in the "Basics" section to see this in action.<br />
The <code>xsl:value-of&gt;</code> is used to extract the value of an XML element and add it to the output stream of the transformation. It is used in conjuction with an <code>select=XPATH</code>.<br />
The <code>&lt;xslLfor-each&gt;</code> element can be used to select every XML element of a specified node-set via <code>select=XPATH</code>. The output can also be filtered, eg <code>&lt;xsl:for-each select="catalog/cd[artist='Bob Dylan']"&gt;</code>, legal filter operators are <code>, !</code>, &amp;lt;, &amp;gt; <br />
The <code>&lt;xsl:sort</code> element is used to sort the output - the <b>select</b> attribbute indicates which XML element to sort on.<br />
To add a conditional test, add the <code>&lt;xsl:if&gt;</code> element with a <code>test="expression"</code> . The <code>&lt;xsl:choose&gt;</code> element is used in conjunction with <code>&lt;xsl:when test="expression"&gt;</code> and <code>xsl:otherwise&gt;</code> to express multiple conditional tests:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">choose</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">when</span> <span style="color: #268bd2;">test</span>=<span style="color: #2aa198;">"expression"</span>&gt;
    ... some output ...
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">when</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">otherwise</span>&gt;
    ... some output ....
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">otherwise</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">choose</span>&gt;
</pre>
</div>

<hr />
<p>
<b>Example showcasing the above basics:</b><br />
The root element that declares the document to be an XSL style sheet is &lt;xsl:stylesheet&gt; or &lt;xsl:transform&gt;. We want to transform the following XML document "cdcatalog.xml" into XHTML:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="UTF-8"</span>?&gt;
&lt;<span style="color: #b58900;">catalog</span>&gt;
  &lt;<span style="color: #b58900;">cd</span>&gt;
    &lt;<span style="color: #b58900;">title</span>&gt;Empire Burlesque&lt;/<span style="color: #b58900;">title</span>&gt;
    &lt;<span style="color: #b58900;">artist</span>&gt;Bob Dylan&lt;/<span style="color: #b58900;">artist</span>&gt;
    &lt;<span style="color: #b58900;">country</span>&gt;USA&lt;/<span style="color: #b58900;">country</span>&gt;
    &lt;<span style="color: #b58900;">company</span>&gt;Columbia&lt;/<span style="color: #b58900;">company</span>&gt;
    &lt;<span style="color: #b58900;">price</span>&gt;10.90&lt;/<span style="color: #b58900;">price</span>&gt;
    &lt;<span style="color: #b58900;">year</span>&gt;1985&lt;/<span style="color: #b58900;">year</span>&gt;
  &lt;/<span style="color: #b58900;">cd</span>&gt;
...
...
&lt;/<span style="color: #b58900;">catalog</span>&gt;
</pre>
</div>
<p>
First create an XSL stylesheet "cdcatalog.xsl" with a transformation table:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="UTF-8"</span>?&gt;

&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">stylesheet</span> <span style="color: #268bd2;">version</span>=<span style="color: #2aa198;">"1.0"</span>
                <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xsl</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/XSL/Transform"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span> <span style="color: #268bd2;">match</span>=<span style="color: #2aa198;">"/"</span>&gt;
    &lt;<span style="color: #b58900;">html</span>&gt;
      &lt;<span style="color: #b58900;">body</span>&gt;
        &lt;<span style="color: #b58900;">h2</span>&gt;My CD Collection&lt;/<span style="color: #b58900;">h2</span>&gt;
        &lt;<span style="color: #b58900;">table</span> <span style="color: #268bd2;">border</span>=<span style="color: #2aa198;">"1"</span>&gt;
          &lt;<span style="color: #b58900;">tr</span> <span style="color: #268bd2;">bgcolor</span>=<span style="color: #2aa198;">"#9acd32"</span>&gt;
            &lt;<span style="color: #b58900;">th</span>&gt;Title&lt;/<span style="color: #b58900;">th</span>&gt;
            &lt;<span style="color: #b58900;">th</span>&gt;Artist&lt;/<span style="color: #b58900;">th</span>&gt;
          &lt;/<span style="color: #b58900;">tr</span>&gt;
          &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"catalog/cd"</span>&gt;
            &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">sort</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"artist"</span>/&gt;
            &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">if</span> <span style="color: #268bd2;">test</span>=<span style="color: #2aa198;">"price </span><span style="color: #6c71c4;">&amp;</span><span style="color: #6c71c4;">gt</span><span style="color: #6c71c4;">;</span><span style="color: #2aa198;"> 10"</span>&gt;
              &lt;<span style="color: #b58900;">tr</span>&gt;
                &lt;<span style="color: #b58900;">td</span>&gt;&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">value-of</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"title"</span>/&gt;&lt;/<span style="color: #b58900;">td</span>&gt;
                &lt;<span style="color: #b58900;">td</span>&gt;&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">value-of</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"artist"</span>/&gt;&lt;/<span style="color: #b58900;">td</span>&gt;
              &lt;/<span style="color: #b58900;">tr</span>&gt;
            &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">if</span>&gt;
          &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span>&gt;
        &lt;/<span style="color: #b58900;">table</span>&gt;
      &lt;/<span style="color: #b58900;">body</span>&gt;
    &lt;/<span style="color: #b58900;">html</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">stylesheet</span>&gt;
</pre>
</div>
<p>
And then link the XSL stylesheet into the XML document from before by putting <code>&lt;?xml-stylesheet type="text/xsl" href="cdcatalog.xsl"?&gt;</code> before the root element.
</p>
</div>
</div>
