uni/informatik/xml/quickguides.tex
\subsection{Basics}
\label{sec:orgf06dd25}
An XSL style sheet consists of one or more set of rules that are called templates. A template contains rules to apply when a specified node is matched.\\
The \texttt{<xsl:template>} element is used to build templates.
The match attribute is used to associate a template with an XML element. The match attribute can also be used to define a template for the entire XML document. The value of the match attribute is an XPath expression (i.e. \texttt{match="/"} defines the whole document). Look at the previous example in the "Basics" section to see this in action.\\
The \texttt{xsl:value-of>} is used to extract the value of an XML element and add it to the output stream of the transformation. It is used in conjuction with an \texttt{select=XPATH}.\\
The \texttt{<xslLfor-each>} element can be used to select every XML element of a specified node-set via \texttt{select=XPATH}. The output can also be filtered, eg \texttt{<xsl:for-each select="catalog/cd[artist='Bob Dylan']">}, legal filter operators are \texttt{, !}, \&lt;, \&gt; \\
The \texttt{<xsl:sort} element is used to sort the output - the \textbf{select} attribbute indicates which XML element to sort on.\\
To add a conditional test, add the \texttt{<xsl:if>} element with a \texttt{test="expression"} . The \texttt{<xsl:choose>} element is used in conjunction with \texttt{<xsl:when test="expression">} and \texttt{xsl:otherwise>} to express multiple conditional tests:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<xsl:choose>
  <xsl:when test="expression">
    ... some output ...
  </xsl:when>
  <xsl:otherwise>
    ... some output ....
  </xsl:otherwise>
</xsl:choose>
\end{lstlisting}

\noindent\rule{\textwidth}{0.5pt}
\textbf{Example showcasing the above basics:}\\
The root element that declares the document to be an XSL style sheet is <xsl:stylesheet> or <xsl:transform>. We want to transform the following XML document "cdcatalog.xml" into XHTML:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0" encoding="UTF-8"?>
<catalog>
  <cd>
    <title>Empire Burlesque</title>
    <artist>Bob Dylan</artist>
    <country>USA</country>
    <company>Columbia</company>
    <price>10.90</price>
    <year>1985</year>
  </cd>
...
...
</catalog>
\end{lstlisting}
First create an XSL stylesheet "cdcatalog.xsl" with a transformation table:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0" encoding="UTF-8"?>

<xsl:stylesheet version="1.0"
                xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:template match="/">
    <html>
      <body>
        <h2>My CD Collection</h2>
        <table border="1">
          <tr bgcolor="#9acd32">
            <th>Title</th>
            <th>Artist</th>
          </tr>
          <xsl:for-each select="catalog/cd">
            <xsl:sort select="artist"/>
            <xsl:if test="price &gt; 10">
              <tr>
                <td><xsl:value-of select="title"/></td>
                <td><xsl:value-of select="artist"/></td>
              </tr>
            </xsl:if>
          </xsl:for-each>
        </table>
      </body>
    </html>
  </xsl:template>
</xsl:stylesheet>
\end{lstlisting}
And then link the XSL stylesheet into the XML document from before by putting \texttt{<?xml-stylesheet type="text/xsl" href="cdcatalog.xsl"?>} before the root element.
