uni/informatik/xml/quickguides.org
** Template Example
XML:
#+BEGIN_SRC xml
<!xml version="1.0"?>
<deliveries>
  <article id="3526">
    <name>apple</name>
    <price unitprice="true">8.97</price>
    <suppler>Fa. Krause</supplier>
  </article>
  <article id="7866">
    <name>cherries</name>
    <price unitprice="true">10.45</price>
    <suppler>Fa. Helbig</supplier>
  </article>
  <article id="3526">
    <name>apple</name>
    <price unitprice="true">12.67</price>
    <suppler>Fa. Liebig</supplier>
  </article>
  (...)
  <article id="7789">
    <name>pineapple</name>
    <price unitprice="true">8.60</price>
    <suppler>Fa. Richard</supplier>
  </article>
</deliveries>
#+END_SRC
Write an XSL transformation which produces the following result:
- Fa. Helbig supplies: cherries
- Fa. Liebig supplies: apple
- Fa. Krause supplies: apple cherries
- Fa. Hoeller supplies: cherries cabbage banana
- Fa. Reinhardt supplies: cabbage
- Fa. Richard supplies: cherries pineapple

Solution:
#+BEGIN_SRC xml
<?xml version="1.0" encoding="utf-8"?>
<xsl:stylesheet version="1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
  <xsl:output method="html" encoding="utf-8"/>
  <xsl:template match="seite">
    <xsl:apply-templates select="document('deliveries.xml')"/>
  </xsl:template>

  <xsl:template match="deliveries">
    <html>
      <head><title><xsl:text>suppliers</xsl:text></title></head>
      <body bgcolor="#ffffff">
        <xsl:for-each select="//supplier[not(preceding::supplier/. = .)]">
          <xsl:apply-templates select=".">
          </xsl:apply-templates>
        </xsl:for-each>
      </body>
    </html>
  </xsl:template>

  <xsl:template match="supplier">
    <p>
      <xsl:value-of select="text()"/><xsl:text> supplies </xsl:text>
      <xsl:for-each select="//article[supplier/text() = current()/text()]">
        <xsl:value-of select="name/text()"/><xsl:text> <xsl:text>
      </xsl:for-each>
    </p>
  </xsl:template>

</xsl:stylesheet>
#+END_SRC

* XPath Reference
