uni/informatik/xml/quickguides.html
<div id="outline-container-orgcb24844" class="outline-3">
<h3 id="orgcb24844"><span class="section-number-3">3.2</span> Template Example</h3>
<div class="outline-text-3" id="text-3-2">
<p>
XML:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;!xml version="1.0"?&gt;
&lt;<span style="color: #b58900;">deliveries</span>&gt;
  &lt;<span style="color: #b58900;">article</span> <span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"3526"</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;apple&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">price</span> <span style="color: #268bd2;">unitprice</span>=<span style="color: #2aa198;">"true"</span>&gt;8.97&lt;/<span style="color: #b58900;">price</span>&gt;
    &lt;<span style="color: #b58900;">suppler</span>&gt;Fa. Krause&lt;/<span style="color: #b58900;">supplier</span>&gt;
  &lt;/<span style="color: #b58900;">article</span>&gt;
  &lt;<span style="color: #b58900;">article</span> <span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"7866"</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;cherries&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">price</span> <span style="color: #268bd2;">unitprice</span>=<span style="color: #2aa198;">"true"</span>&gt;10.45&lt;/<span style="color: #b58900;">price</span>&gt;
    &lt;<span style="color: #b58900;">suppler</span>&gt;Fa. Helbig&lt;/<span style="color: #b58900;">supplier</span>&gt;
  &lt;/<span style="color: #b58900;">article</span>&gt;
  &lt;<span style="color: #b58900;">article</span> <span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"3526"</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;apple&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">price</span> <span style="color: #268bd2;">unitprice</span>=<span style="color: #2aa198;">"true"</span>&gt;12.67&lt;/<span style="color: #b58900;">price</span>&gt;
    &lt;<span style="color: #b58900;">suppler</span>&gt;Fa. Liebig&lt;/<span style="color: #b58900;">supplier</span>&gt;
  &lt;/<span style="color: #b58900;">article</span>&gt;
  (...)
  &lt;<span style="color: #b58900;">article</span> <span style="color: #268bd2;">id</span>=<span style="color: #2aa198;">"7789"</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;pineapple&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">price</span> <span style="color: #268bd2;">unitprice</span>=<span style="color: #2aa198;">"true"</span>&gt;8.60&lt;/<span style="color: #b58900;">price</span>&gt;
    &lt;<span style="color: #b58900;">suppler</span>&gt;Fa. Richard&lt;/<span style="color: #b58900;">supplier</span>&gt;
  &lt;/<span style="color: #b58900;">article</span>&gt;
&lt;/<span style="color: #b58900;">deliveries</span>&gt;
</pre>
</div>
<p>
Write an XSL transformation which produces the following result:
</p>
<ul class="org-ul">
<li>Fa. Helbig supplies: cherries</li>
<li>Fa. Liebig supplies: apple</li>
<li>Fa. Krause supplies: apple cherries</li>
<li>Fa. Hoeller supplies: cherries cabbage banana</li>
<li>Fa. Reinhardt supplies: cabbage</li>
<li>Fa. Richard supplies: cherries pineapple</li>
</ul>

<p>
Solution:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">stylesheet</span> <span style="color: #268bd2;">version</span>=<span style="color: #2aa198;">"1.0"</span> <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">xsl</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/XSL/Transform"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">output</span> <span style="color: #268bd2;">method</span>=<span style="color: #2aa198;">"html"</span> <span style="color: #268bd2;">encoding</span>=<span style="color: #2aa198;">"utf-8"</span>/&gt;
  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span> <span style="color: #268bd2;">match</span>=<span style="color: #2aa198;">"seite"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">apply-templates</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"document('deliveries.xml')"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span>&gt;

  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span> <span style="color: #268bd2;">match</span>=<span style="color: #2aa198;">"deliveries"</span>&gt;
    &lt;<span style="color: #b58900;">html</span>&gt;
      &lt;<span style="color: #b58900;">head</span>&gt;&lt;<span style="color: #b58900;">title</span>&gt;&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt;suppliers&lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt;&lt;/<span style="color: #b58900;">title</span>&gt;&lt;/<span style="color: #b58900;">head</span>&gt;
      &lt;<span style="color: #b58900;">body</span> <span style="color: #268bd2;">bgcolor</span>=<span style="color: #2aa198;">"#ffffff"</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"//supplier[not(preceding::supplier/. = .)]"</span>&gt;
          &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">apply-templates</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"."</span>&gt;
          &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">apply-templates</span>&gt;
        &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span>&gt;
      &lt;/<span style="color: #b58900;">body</span>&gt;
    &lt;/<span style="color: #b58900;">html</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span>&gt;

  &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span> <span style="color: #268bd2;">match</span>=<span style="color: #2aa198;">"supplier"</span>&gt;
    &lt;<span style="color: #b58900;">p</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">value-of</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"text()"</span>/&gt;&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt; supplies &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt;
      &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"//article[supplier/text() = current()/text()]"</span>&gt;
        &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">value-of</span> <span style="color: #268bd2;">select</span>=<span style="color: #2aa198;">"name/text()"</span>/&gt;&lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt; &lt;<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">text</span>&gt;
      &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">for-each</span>&gt;
    &lt;/<span style="color: #b58900;">p</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">template</span>&gt;

&lt;/<span style="color: #d33682; font-style: italic;">xsl</span>:<span style="color: #b58900;">stylesheet</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd1325c5" class="outline-2">
<h2 id="orgd1325c5"><span class="section-number-2">4</span> XPath Reference</h2>
<div class="outline-text-2" id="text-4">
</div>
