uni/informatik/xml/quickguides.org
** Selecting nodes
In XPath, there are seven kinds of nodes: element, attribute, text, namespace, processing-instruction, comment, and document nodes.
#+caption: 
| Expression | Description                                                                                           |
|------------+-------------------------------------------------------------------------------------------------------|
| nodename   | selects all nodes with the name "nodename"                                                            |
| \slash     | selects from the root node                                                                            |
| //         | selects nodes in the document from the current node that match the selection no matter where they are |
| .          | selects the current node                                                                              |
| ..         | selects the parent of the current node                                                                |
| @          | selects attributes                                                                                    |

Examples:
| Path Expression                                           | Result                                                                                                                       |
|-----------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------|
| bookstore                                                 | selects all nodes with the name "bookstore"                                                                                  |
| \slash{}bookstore                                         | selects the root element bookstore (absolute path)                                                                           |
| bookstore/book                                            | selects all book elements that are children of bookstore                                                                     |
| \slash{}\slash{}book                                      | selects all book elements no matter where they are in the document                                                           |
| bookstore\slash{}book                                     | selects all book elements that are descendant of the bookstore element, no matter where they are under the bookstore element |
| \slash{}\slash{}@lang                                     | selects all attributes that are named lang                                                                                   |
| \slash{}\slash{}Sales.Customer[starts-with(Name, 'Jans')] | all customers from which the name starts with 'Jans'                                                                         |

** Predicates
Predicates are used to find a specific node or a node that contains a specific value.
Predicates are always embedded in square brackets.
In the table beloware some path expressions with predicates and the result of the expressions:
| Path Expression                                         | Result                                                                                                   |
|---------------------------------------------------------+----------------------------------------------------------------------------------------------------------|
| \slash{}bookstore\slash{}book[1]                        | selects the first book element that is the child of the bookstore element                                |
| \slash{}bookstore\slash{}book[last()]                   | selects the last book element that is the child of the bookstore element                                 |
| \slash{}bookstore\slash{}book[last()-1]                 | selects the second to last book element that is the child of the bookstore element                       |
| \slash{}bookstore\slash{}book[position()<3]             | selects the first two book elements that are child of bookstore                                          |
| \slash{}title[@lang='en']                               | selects all title elements that have a "lang" attr with val "en"                                         |
| \slash{}bookstore\slash{}book[price>35.00]              | selects all the book elements of the bookstore that have a price val higher than 35.00                   |
| \slash{}bookstore\slash{}book[price>35.00]\slash{}title | selects all the title elements of book elements of the bookstore that have a price val higher than 35.00 |

** Selecting unknown nodes
XPath wildcards can be used to select unknown XML nodes:
| Wildcard | Description                  |
|----------+------------------------------|
| *        | matches any element node     |
| @*       | matches any attribute node   |
| node()   | matches any node of any kind |
Examples:
| Path Expression | Result                                                                   |
|-----------------+--------------------------------------------------------------------------|
| /bookstore/*    | selects all the child element nodes of the bookstore element             |
| //*             | selects all elements in the document                                     |
| //title[@*]     | selects all title elements which have at least one attribute of any kind |

By using the "|" operator to separate XPath expressions multiple paths can be selected eg ~//book/title | //book/price~ selects all the title AND price elements of all book elements

