uni/informatik/xml/quickguides.html
<div id="outline-container-org6690cdb" class="outline-3">
<h3 id="org6690cdb"><span class="section-number-3">4.1</span> Selecting nodes</h3>
<div class="outline-text-3" id="text-4-1">
<p>
In XPath, there are seven kinds of nodes: element, attribute, text, namespace, processing-instruction, comment, and document nodes.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> </caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Expression</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nodename</td>
<td class="org-left">selects all nodes with the name "nodename"</td>
</tr>

<tr>
<td class="org-left">/</td>
<td class="org-left">selects from the root node</td>
</tr>

<tr>
<td class="org-left">//</td>
<td class="org-left">selects nodes in the document from the current node that match the selection no matter where they are</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">selects the current node</td>
</tr>

<tr>
<td class="org-left">..</td>
<td class="org-left">selects the parent of the current node</td>
</tr>

<tr>
<td class="org-left">@</td>
<td class="org-left">selects attributes</td>
</tr>
</tbody>
</table>

<p>
Examples:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Path Expression</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bookstore</td>
<td class="org-left">selects all nodes with the name "bookstore"</td>
</tr>

<tr>
<td class="org-left">/bookstore</td>
<td class="org-left">selects the root element bookstore (absolute path)</td>
</tr>

<tr>
<td class="org-left">bookstore/book</td>
<td class="org-left">selects all book elements that are children of bookstore</td>
</tr>

<tr>
<td class="org-left">//book</td>
<td class="org-left">selects all book elements no matter where they are in the document</td>
</tr>

<tr>
<td class="org-left">bookstore/book</td>
<td class="org-left">selects all book elements that are descendant of the bookstore element, no matter where they are under the bookstore element</td>
</tr>

<tr>
<td class="org-left">//@lang</td>
<td class="org-left">selects all attributes that are named lang</td>
</tr>

<tr>
<td class="org-left">//Sales.Customer[starts-with(Name, 'Jans')]</td>
<td class="org-left">all customers from which the name starts with 'Jans'</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org388a052" class="outline-3">
<h3 id="org388a052"><span class="section-number-3">4.2</span> Predicates</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Predicates are used to find a specific node or a node that contains a specific value.
Predicates are always embedded in square brackets.
In the table beloware some path expressions with predicates and the result of the expressions:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Path Expression</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/bookstore/book[1]</td>
<td class="org-left">selects the first book element that is the child of the bookstore element</td>
</tr>

<tr>
<td class="org-left">/bookstore/book[last()]</td>
<td class="org-left">selects the last book element that is the child of the bookstore element</td>
</tr>

<tr>
<td class="org-left">/bookstore/book[last()-1]</td>
<td class="org-left">selects the second to last book element that is the child of the bookstore element</td>
</tr>

<tr>
<td class="org-left">/bookstore/book[position()&lt;3]</td>
<td class="org-left">selects the first two book elements that are child of bookstore</td>
</tr>

<tr>
<td class="org-left">/title[@lang='en']</td>
<td class="org-left">selects all title elements that have a "lang" attr with val "en"</td>
</tr>

<tr>
<td class="org-left">/bookstore/book[price&gt;35.00]</td>
<td class="org-left">selects all the book elements of the bookstore that have a price val higher than 35.00</td>
</tr>

<tr>
<td class="org-left">/bookstore/book[price&gt;35.00]/title</td>
<td class="org-left">selects all the title elements of book elements of the bookstore that have a price val higher than 35.00</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org970483f" class="outline-3">
<h3 id="org970483f"><span class="section-number-3">4.3</span> Selecting unknown nodes</h3>
<div class="outline-text-3" id="text-4-3">
<p>
XPath wildcards can be used to select unknown XML nodes:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wildcard</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">*</td>
<td class="org-left">matches any element node</td>
</tr>

<tr>
<td class="org-left">@*</td>
<td class="org-left">matches any attribute node</td>
</tr>

<tr>
<td class="org-left">node()</td>
<td class="org-left">matches any node of any kind</td>
</tr>
</tbody>
</table>
<p>
Examples:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Path Expression</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/bookstore/*</td>
<td class="org-left">selects all the child element nodes of the bookstore element</td>
</tr>

<tr>
<td class="org-left">//*</td>
<td class="org-left">selects all elements in the document</td>
</tr>

<tr>
<td class="org-left">//title[@*]</td>
<td class="org-left">selects all title elements which have at least one attribute of any kind</td>
</tr>
</tbody>
</table>

<p>
By using the "|" operator to separate XPath expressions multiple paths can be selected eg <code>//book/title | //book/price</code> selects all the title AND price elements of all book elements
</p>
</div>
</div>
</div>
