uni/informatik/xml/quickguides.tex
\subsection{Selecting nodes}
\label{sec:orgfe875b6}
In XPath, there are seven kinds of nodes: element, attribute, text, namespace, processing-instruction, comment, and document nodes.
\begin{table}[htbp]
\caption{}
\centering
\begin{tabular}{ll}
Expression & Description\\
\hline
nodename & selects all nodes with the name "nodename"\\
/ & selects from the root node\\
// & selects nodes in the document from the current node that match the selection no matter where they are\\
. & selects the current node\\
.. & selects the parent of the current node\\
@ & selects attributes\\
\end{tabular}
\end{table}

Examples:
\begin{center}
\begin{tabular}{ll}
Path Expression & Result\\
\hline
bookstore & selects all nodes with the name "bookstore"\\
/bookstore & selects the root element bookstore (absolute path)\\
bookstore/book & selects all book elements that are children of bookstore\\
//book & selects all book elements no matter where they are in the document\\
bookstore/book & selects all book elements that are descendant of the bookstore element, no matter where they are under the bookstore element\\
//@lang & selects all attributes that are named lang\\
//Sales.Customer[starts-with(Name, 'Jans')] & all customers from which the name starts with 'Jans'\\
\end{tabular}
\end{center}

\subsection{Predicates}
\label{sec:org303e8bf}
Predicates are used to find a specific node or a node that contains a specific value.
Predicates are always embedded in square brackets.
In the table beloware some path expressions with predicates and the result of the expressions:
\begin{center}
\begin{tabular}{ll}
Path Expression & Result\\
\hline
/bookstore/book[1] & selects the first book element that is the child of the bookstore element\\
/bookstore/book[last()] & selects the last book element that is the child of the bookstore element\\
/bookstore/book[last()-1] & selects the second to last book element that is the child of the bookstore element\\
/bookstore/book[position()<3] & selects the first two book elements that are child of bookstore\\
/title[@lang='en'] & selects all title elements that have a "lang" attr with val "en"\\
/bookstore/book[price>35.00] & selects all the book elements of the bookstore that have a price val higher than 35.00\\
/bookstore/book[price>35.00]/title & selects all the title elements of book elements of the bookstore that have a price val higher than 35.00\\
\end{tabular}
\end{center}

\subsection{Selecting unknown nodes}
\label{sec:org8b6d85b}
XPath wildcards can be used to select unknown XML nodes:
\begin{center}
\begin{tabular}{ll}
Wildcard & Description\\
\hline
* & matches any element node\\
@* & matches any attribute node\\
node() & matches any node of any kind\\
\end{tabular}
\end{center}
Examples:
\begin{center}
\begin{tabular}{ll}
Path Expression & Result\\
\hline
/bookstore/* & selects all the child element nodes of the bookstore element\\
//* & selects all elements in the document\\
//title[@*] & selects all title elements which have at least one attribute of any kind\\
\end{tabular}
\end{center}

By using the "|" operator to separate XPath expressions multiple paths can be selected eg \texttt{//book/title | //book/price} selects all the title AND price elements of all book elements
