uni/informatik/xml/quickguides.org
* RDF
RDF triple: Describes a statement in form of a relationship (P) between a subject (S) and an object (O).
- Statement describes a thing S, where a property P is provided with a value of O
- RDF triple (S,P,O)
  - Subject - Predicate - Object, or technically Subject - Property - Object
- P connects S and O
- S and P are URIs, O is a URI or a literal
- conceptually P connects S and O

First example statement: "Gaedke is gay"
- S = <http://gaedke.com/>, P = <http://.../is>, O = <http://.../gay>
- statements as an RDF triple: <http://gaedke.com/>,<http://.../is>,<http://.../gay>
  
RDF is a data model...machine-readable implementations include RDF/XML, Notation 3 (N3), Turtle, etc.
** RDF/XML
- =rdf:Description= elements describe resources (*Subjects*)
- nested elements are properties/predicates (*P*)
- attributes /or/ contents of a property element describe *Objects* (O)
For example:
#+BEGIN_SRC xml
<?xml version="1.0" encoding="utf-8"?>
<rdf:RDF xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
         xmlns:zt="http://example.org/evkonzept#">
  <rdf:Description about="http://zoo.../tiere#t12">
    <zt:Vatervon resource="http://zoo.../tiere#t34"/>
    <zt:Name>Teddy</zt:Name>
  </rdf:Description>
</rdf:RDF>
#+END_SRC
- Tier 12 (=t12=) is the subject, =zt:Vatervon= is the property and Tier 34 (=t34=) is the object (URI)
- Tier 12 (=t12=) is the subject, =zt:Name= is the property and "Teddy" is the object (literal)

** RDF Schema
RDF Vocabulary Description Language to defined the vocabulary similar to XML Schema is defined via ~xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"~. RDF Schema does not provide actual application-specific classes and properties. Instead RDF Schema provides the framework to describe application-specific classes and properties.
Classes in RDF Schema are much like classes in object oriented programming languages. This allows resources to be defined as instances of classes, and subclasses of classes.\\
Example 1:
#+BEGIN_SRC xml
<?xml version="1.0"?>
<rdf:RDF
    xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
    xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"
    xml:base="http://www.animals.fake/animals#">

  <rdf:Description rdf:ID="animal">
    <rdf:type rdf:resource="http://www.w3.org/2000/01/rdf-schema#Class"/>
  </rdf:Description>

  <rdf:Description rdf:ID="horse">
    <rdf:type rdf:resource="http://www.w3.org/2000/01/rdf-schema#Class"/>
    <rdfs:subClassOf rdf:resource="#animal"/>
  </rdf:Description>

</rdf:RDF>
#+END_SRC
In the example above, the resource "horse" is a subclass of the class "animal". Since an RDFS class is an RDF resource we can abbreviate the example above by using rdfs:Class instead of rdf:Description, and drop the rdf:type information:
#+BEGIN_SRC xml
<?xml version="1.0"?>

<rdf:RDF
xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"
xml:base="http://www.animals.fake/animals#">

<rdfs:Class rdf:ID="animal" />

<rdfs:Class rdf:ID="horse">
  <rdfs:subClassOf rdf:resource="#animal"/>
</rdfs:Class>

</rdf:RDF>
#+END_SRC

