uni/informatik/xml/quickguides.html

<div id="outline-container-org75d74e3" class="outline-2">
<h2 id="org75d74e3"><span class="section-number-2">5</span> RDF</h2>
<div class="outline-text-2" id="text-5">
<p>
RDF triple: Describes a statement in form of a relationship (P) between a subject (S) and an object (O).
</p>
<ul class="org-ul">
<li>Statement describes a thing S, where a property P is provided with a value of O</li>
<li>RDF triple (S,P,O)
<ul class="org-ul">
<li>Subject - Predicate - Object, or technically Subject - Property - Object</li>
</ul></li>
<li>P connects S and O</li>
<li>S and P are URIs, O is a URI or a literal</li>
<li>conceptually P connects S and O</li>
</ul>

<p>
First example statement: "Gaedke is gay"
</p>
<ul class="org-ul">
<li>S = <a href="http://gaedke.com/">http://gaedke.com/</a>, P = <a href="http://.../is">http://.../is</a>, O = <a href="http://.../gay">http://.../gay</a></li>
<li>statements as an RDF triple: <a href="http://gaedke.com/">http://gaedke.com/</a>,<a href="http://.../is">http://.../is</a>,<a href="http://.../gay">http://.../gay</a></li>
</ul>

<p>
RDF is a data model&#x2026;machine-readable implementations include RDF/XML, Notation 3 (N3), Turtle, etc.
</p>
</div>
<div id="outline-container-orgcbb7e13" class="outline-3">
<h3 id="orgcbb7e13"><span class="section-number-3">5.1</span> RDF/XML</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><code>rdf:Description</code> elements describe resources (<b>Subjects</b>)</li>
<li>nested elements are properties/predicates (<b>P</b>)</li>
<li>attributes <i>or</i> contents of a property element describe <b>Objects</b> (O)</li>
</ul>
<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0" encoding="utf-8"</span>?&gt;
&lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span> <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">rdf</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/02/22-rdf-syntax-ns#"</span>
         <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">zt</span>=<span style="color: #2aa198;">"http://example.org/evkonzept#"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span> <span style="color: #268bd2;">about</span>=<span style="color: #2aa198;">"http://zoo.../tiere#t12"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">zt</span>:<span style="color: #b58900;">Vatervon</span> <span style="color: #268bd2;">resource</span>=<span style="color: #2aa198;">"http://zoo.../tiere#t34"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">zt</span>:<span style="color: #b58900;">Name</span>&gt;Teddy&lt;/<span style="color: #d33682; font-style: italic;">zt</span>:<span style="color: #b58900;">Name</span>&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span>&gt;
&lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span>&gt;
</pre>
</div>
<ul class="org-ul">
<li>Tier 12 (<code>t12</code>) is the subject, <code>zt:Vatervon</code> is the property and Tier 34 (<code>t34</code>) is the object (URI)</li>
<li>Tier 12 (<code>t12</code>) is the subject, <code>zt:Name</code> is the property and "Teddy" is the object (literal)</li>
</ul>
</div>
</div>

<div id="outline-container-org80fd54b" class="outline-3">
<h3 id="org80fd54b"><span class="section-number-3">5.2</span> RDF Schema</h3>
<div class="outline-text-3" id="text-5-2">
<p>
RDF Vocabulary Description Language to defined the vocabulary similar to XML Schema is defined via <code>xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"</code>. RDF Schema does not provide actual application-specific classes and properties. Instead RDF Schema provides the framework to describe application-specific classes and properties.
Classes in RDF Schema are much like classes in object oriented programming languages. This allows resources to be defined as instances of classes, and subclasses of classes.<br />
Example 1:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;
&lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span>
    <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">rdf</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/02/22-rdf-syntax-ns#"</span>
    <span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">rdfs</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span>
    <span style="color: #d33682; font-style: italic;">xml</span>:<span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"http://www.animals.fake/animals#"</span>&gt;

  &lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">ID</span>=<span style="color: #2aa198;">"animal"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">type</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">resource</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#Class"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span>&gt;

  &lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">ID</span>=<span style="color: #2aa198;">"horse"</span>&gt;
    &lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">type</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">resource</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#Class"</span>/&gt;
    &lt;<span style="color: #d33682; font-style: italic;">rdfs</span>:<span style="color: #b58900;">subClassOf</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">resource</span>=<span style="color: #2aa198;">"#animal"</span>/&gt;
  &lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">Description</span>&gt;

&lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span>&gt;
</pre>
</div>
<p>
In the example above, the resource "horse" is a subclass of the class "animal". Since an RDFS class is an RDF resource we can abbreviate the example above by using rdfs:Class instead of rdf:Description, and drop the rdf:type information:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?<span style="color: #859900;">xml</span> <span style="color: #35a69c; font-style: italic;">version="1.0"</span>?&gt;

&lt;<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span>
<span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">rdf</span>=<span style="color: #2aa198;">"http://www.w3.org/1999/02/22-rdf-syntax-ns#"</span>
<span style="color: #d33682; font-style: italic;">xmlns</span>:<span style="color: #268bd2;">rdfs</span>=<span style="color: #2aa198;">"http://www.w3.org/2000/01/rdf-schema#"</span>
<span style="color: #d33682; font-style: italic;">xml</span>:<span style="color: #268bd2;">base</span>=<span style="color: #2aa198;">"http://www.animals.fake/animals#"</span>&gt;

&lt;<span style="color: #d33682; font-style: italic;">rdfs</span>:<span style="color: #b58900;">Class</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">ID</span>=<span style="color: #2aa198;">"animal"</span> /&gt;

&lt;<span style="color: #d33682; font-style: italic;">rdfs</span>:<span style="color: #b58900;">Class</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">ID</span>=<span style="color: #2aa198;">"horse"</span>&gt;
  &lt;<span style="color: #d33682; font-style: italic;">rdfs</span>:<span style="color: #b58900;">subClassOf</span> <span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #268bd2;">resource</span>=<span style="color: #2aa198;">"#animal"</span>/&gt;
&lt;/<span style="color: #d33682; font-style: italic;">rdfs</span>:<span style="color: #b58900;">Class</span>&gt;

&lt;/<span style="color: #d33682; font-style: italic;">rdf</span>:<span style="color: #b58900;">RDF</span>&gt;
</pre>
</div>
</div>
</div>
</div>
