uni/informatik/xml/quickguides.tex

\section{RDF}
\label{sec:orgdd0c5a0}
RDF triple: Describes a statement in form of a relationship (P) between a subject (S) and an object (O).
\begin{itemize}
\item Statement describes a thing S, where a property P is provided with a value of O
\item RDF triple (S,P,O)
\begin{itemize}
\item Subject - Predicate - Object, or technically Subject - Property - Object
\end{itemize}
\item P connects S and O
\item S and P are URIs, O is a URI or a literal
\item conceptually P connects S and O
\end{itemize}

First example statement: "Gaedke is gay"
\begin{itemize}
\item S = \url{http://gaedke.com/}, P = \url{http://.../is}, O = \url{http://.../gay}
\item statements as an RDF triple: \url{http://gaedke.com/},\url{http://.../is},\url{http://.../gay}
\end{itemize}

RDF is a data model\ldots{}machine-readable implementations include RDF/XML, Notation 3 (N3), Turtle, etc.
\subsection{RDF/XML}
\label{sec:orge026092}
\begin{itemize}
\item \texttt{rdf:Description} elements describe resources (\textbf{Subjects})
\item nested elements are properties/predicates (\textbf{P})
\item attributes \emph{or} contents of a property element describe \textbf{Objects} (O)
\end{itemize}
For example:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0" encoding="utf-8"?>
<rdf:RDF xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
         xmlns:zt="http://example.org/evkonzept#">
  <rdf:Description about="http://zoo.../tiere#t12">
    <zt:Vatervon resource="http://zoo.../tiere#t34"/>
    <zt:Name>Teddy</zt:Name>
  </rdf:Description>
</rdf:RDF>
\end{lstlisting}
\begin{itemize}
\item Tier 12 (\texttt{t12}) is the subject, \texttt{zt:Vatervon} is the property and Tier 34 (\texttt{t34}) is the object (URI)
\item Tier 12 (\texttt{t12}) is the subject, \texttt{zt:Name} is the property and "Teddy" is the object (literal)
\end{itemize}

\subsection{RDF Schema}
\label{sec:org33bdb9e}
RDF Vocabulary Description Language to defined the vocabulary similar to XML Schema is defined via \texttt{xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema\#"}. RDF Schema does not provide actual application-specific classes and properties. Instead RDF Schema provides the framework to describe application-specific classes and properties.
Classes in RDF Schema are much like classes in object oriented programming languages. This allows resources to be defined as instances of classes, and subclasses of classes.\\
Example 1:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>
<rdf:RDF
    xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
    xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"
    xml:base="http://www.animals.fake/animals#">

  <rdf:Description rdf:ID="animal">
    <rdf:type rdf:resource="http://www.w3.org/2000/01/rdf-schema#Class"/>
  </rdf:Description>

  <rdf:Description rdf:ID="horse">
    <rdf:type rdf:resource="http://www.w3.org/2000/01/rdf-schema#Class"/>
    <rdfs:subClassOf rdf:resource="#animal"/>
  </rdf:Description>

</rdf:RDF>
\end{lstlisting}
In the example above, the resource "horse" is a subclass of the class "animal". Since an RDFS class is an RDF resource we can abbreviate the example above by using rdfs:Class instead of rdf:Description, and drop the rdf:type information:
\lstset{breaklines=true,language=XML,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
<?xml version="1.0"?>

<rdf:RDF
xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"
xmlns:rdfs="http://www.w3.org/2000/01/rdf-schema#"
xml:base="http://www.animals.fake/animals#">

<rdfs:Class rdf:ID="animal" />

<rdfs:Class rdf:ID="horse">
  <rdfs:subClassOf rdf:resource="#animal"/>
</rdfs:Class>

</rdf:RDF>
\end{lstlisting}
