uni/informatik/xml/quickguides.org
* SPARQL
SPARQL is a query language and a protocol for accessing RDF designed by the W3C RDF Data Access Working Group. 
As a query language, SPARQL is "data-oriented" in that it only queries the information held in the models; there is no inference in the query language itself.  Of course, the Jena model may be 'smart' in that it provides the impression that certain triples exist by creating them on-demand, including OWL reasoning.  SPARQL does not do anything other than take the description of what the application wants, in the form of a query, and returns that information, in the form of a set of bindings or an RDF graph.
** SPARQL Examples
List all persons whose last name is "Smith"
#+BEGIN_SRC sql
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?person
WHERE
{
  ?person vcard:family-name "Smith".
}
#+END_SRC
- in this query the triple pattern will match against triples whose predicate is the =family-name= property from the =vcard= vocabulary whose object is the string ="Smith"= and whose subject is anything (because =?person= is just a variable/wildcard)
- =SELECT= indicates which values should be listed after the query executes
  
The result of such query would be for example ~emp1, emp2~. Because this does not tell much, let's extend the query. Let's add a second triple pattern that matches on the =?givenName= (just a wildcard) for everything that matched in the previous query (first line in =WHERE= statement) and whose predicate is a =given-name= property from the vcard vocab:
#+BEGIN_SRC sql
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?person ?givenName
WHERE
{
  ?person vcard:family-name "Smith".
  ?person vcard:given-name ?givenName.
}
#+END_SRC
Now the result could look like:
| ?person | ?givenName |
|---------+------------|
| emp1    | Heidi      |
| emp2    | John       |

Let's retrieve the given name, family name and hire date of /all/ employees:
#+BEGIN_SRC sql
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?givenName ?familyName ?hd
WHERE
{
  ?person vcard:given-name ?givenName.
  ?person vcard:family-name ?familyName.
  ?person vcard:hireDate ?hd.
}
#+END_SRC
Result:
| ?givenName | ?familyName |        ?hd |
|------------+-------------+------------|
| Jane       | Berger      | 2019-03-10 |
| Francis    | Jones       | 2019-02-13 |
| John       | Smith       | 2019-01-28 |
| Heidi      | Smith       | 2019-01-13 |
To narrow down the above results via some condition we could use filter:
#+BEGIN_SRC sql
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?givenName ?familyName ?hd
WHERE
{
  ?person vcard:given-name ?givenName.
  ?person vcard:family-name ?familyName.
  ?person vcard:hireDate ?hd.
  FILTER(?hd < "2019-03-01")
}
#+END_SRC
Result:
| ?givenName | ?familyName |        ?hd |
|------------+-------------+------------|
| Francis    | Jones       | 2019-02-13 |
| John       | Smith       | 2019-01-28 |
| Heidi      | Smith       | 2019-01-13 |
Let's say we add another triple pattern =?person vcard:completedOrientation ?oDate.=. Now only employees who have an =vcard:completedOrientation= predicate association would be listed. But we still want to show all employees, so in this case the triple pattern should be made optional =OPTIONAL {?person vcard:completedOrientation ?oDate.}=.\\
On the other hand if you want to list every person who has not completed the orientation yet, you would use =NOT EXISTS {?person vcard:completedOrientation ?oDate.}=
