uni/informatik/xml/quickguides.html

<div id="outline-container-org17f3157" class="outline-2">
<h2 id="org17f3157"><span class="section-number-2">6</span> SPARQL</h2>
<div class="outline-text-2" id="text-6">
<p>
SPARQL is a query language and a protocol for accessing RDF designed by the W3C RDF Data Access Working Group. 
As a query language, SPARQL is "data-oriented" in that it only queries the information held in the models; there is no inference in the query language itself.  Of course, the Jena model may be 'smart' in that it provides the impression that certain triples exist by creating them on-demand, including OWL reasoning.  SPARQL does not do anything other than take the description of what the application wants, in the form of a query, and returns that information, in the form of a set of bindings or an RDF graph.
</p>
</div>
<div id="outline-container-orgc29a895" class="outline-3">
<h3 id="orgc29a895"><span class="section-number-3">6.1</span> SPARQL Examples</h3>
<div class="outline-text-3" id="text-6-1">
<p>
List all persons whose last name is "Smith"
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">PREFIX</span> vcard: <a href="http://www.w3.org/2006/vcard/ns#">&lt;http://www.w3.org/2006/vcard/ns#&gt;</a>

<span style="color: #859900;">SELECT</span> ?person
<span style="color: #859900;">WHERE</span>
<span style="color: #268bd2;">{</span>
  ?person vcard:family-<span style="color: #859900;">name</span> "Smith".
<span style="color: #268bd2;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>in this query the triple pattern will match against triples whose predicate is the <code>family-name</code> property from the <code>vcard</code> vocabulary whose object is the string <code>"Smith"</code> and whose subject is anything (because <code>?person</code> is just a variable/wildcard)</li>
<li><code>SELECT</code> indicates which values should be listed after the query executes</li>
</ul>

<p>
The result of such query would be for example <code>emp1, emp2</code>. Because this does not tell much, let's extend the query. Let's add a second triple pattern that matches on the <code>?givenName</code> (just a wildcard) for everything that matched in the previous query (first line in <code>WHERE</code> statement) and whose predicate is a <code>given-name</code> property from the vcard vocab:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">PREFIX</span> vcard: <a href="http://www.w3.org/2006/vcard/ns#">&lt;http://www.w3.org/2006/vcard/ns#&gt;</a>

<span style="color: #859900;">SELECT</span> ?person ?givenName
<span style="color: #859900;">WHERE</span>
<span style="color: #268bd2;">{</span>
  ?person vcard:family-<span style="color: #859900;">name</span> "Smith".
  ?person vcard:given-<span style="color: #859900;">name</span> ?givenName.
<span style="color: #268bd2;">}</span>
</pre>
</div>
<p>
Now the result could look like:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">?person</th>
<th scope="col" class="org-left">?givenName</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">emp1</td>
<td class="org-left">Heidi</td>
</tr>

<tr>
<td class="org-left">emp2</td>
<td class="org-left">John</td>
</tr>
</tbody>
</table>

<p>
Let's retrieve the given name, family name and hire date of <i>all</i> employees:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">PREFIX</span> vcard: <a href="http://www.w3.org/2006/vcard/ns#">&lt;http://www.w3.org/2006/vcard/ns#&gt;</a>

<span style="color: #859900;">SELECT</span> ?givenName ?familyName ?hd
<span style="color: #859900;">WHERE</span>
<span style="color: #268bd2;">{</span>
  ?person vcard:given-<span style="color: #859900;">name</span> ?givenName.
  ?person vcard:family-<span style="color: #859900;">name</span> ?familyName.
  ?person vcard:hireDate ?hd.
<span style="color: #268bd2;">}</span>
</pre>
</div>
<p>
Result:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">?givenName</th>
<th scope="col" class="org-left">?familyName</th>
<th scope="col" class="org-right">?hd</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Jane</td>
<td class="org-left">Berger</td>
<td class="org-right">2019-03-10</td>
</tr>

<tr>
<td class="org-left">Francis</td>
<td class="org-left">Jones</td>
<td class="org-right">2019-02-13</td>
</tr>

<tr>
<td class="org-left">John</td>
<td class="org-left">Smith</td>
<td class="org-right">2019-01-28</td>
</tr>

<tr>
<td class="org-left">Heidi</td>
<td class="org-left">Smith</td>
<td class="org-right">2019-01-13</td>
</tr>
</tbody>
</table>
<p>
To narrow down the above results via some condition we could use filter:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">PREFIX</span> vcard: <a href="http://www.w3.org/2006/vcard/ns#">&lt;http://www.w3.org/2006/vcard/ns#&gt;</a>

<span style="color: #859900;">SELECT</span> ?givenName ?familyName ?hd
<span style="color: #859900;">WHERE</span>
<span style="color: #268bd2;">{</span>
  ?person vcard:given-<span style="color: #859900;">name</span> ?givenName.
  ?person vcard:family-<span style="color: #859900;">name</span> ?familyName.
  ?person vcard:hireDate ?hd.
  FILTER<span style="color: #d33682;">(</span>?hd &lt; "2019-03-01"<span style="color: #d33682;">)</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>
<p>
Result:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">?givenName</th>
<th scope="col" class="org-left">?familyName</th>
<th scope="col" class="org-right">?hd</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Francis</td>
<td class="org-left">Jones</td>
<td class="org-right">2019-02-13</td>
</tr>

<tr>
<td class="org-left">John</td>
<td class="org-left">Smith</td>
<td class="org-right">2019-01-28</td>
</tr>

<tr>
<td class="org-left">Heidi</td>
<td class="org-left">Smith</td>
<td class="org-right">2019-01-13</td>
</tr>
</tbody>
</table>
<p>
Let's say we add another triple pattern <code>?person vcard:completedOrientation ?oDate.</code>. Now only employees who have an <code>vcard:completedOrientation</code> predicate association would be listed. But we still want to show all employees, so in this case the triple pattern should be made optional <code>OPTIONAL {?person vcard:completedOrientation ?oDate.}</code>.<br />
On the other hand if you want to list every person who has not completed the orientation yet, you would use <code>NOT EXISTS {?person vcard:completedOrientation ?oDate.}</code>
</p>
</div>
</div>
</div>
