uni/informatik/xml/quickguides.tex

\section{SPARQL}
\label{sec:orgc4fe191}
SPARQL is a query language and a protocol for accessing RDF designed by the W3C RDF Data Access Working Group. 
As a query language, SPARQL is "data-oriented" in that it only queries the information held in the models; there is no inference in the query language itself.  Of course, the Jena model may be 'smart' in that it provides the impression that certain triples exist by creating them on-demand, including OWL reasoning.  SPARQL does not do anything other than take the description of what the application wants, in the form of a query, and returns that information, in the form of a set of bindings or an RDF graph.
\subsection{SPARQL Examples}
\label{sec:org6d012fc}
List all persons whose last name is "Smith"
\lstset{breaklines=true,language=SQL,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?person
WHERE
{
  ?person vcard:family-name "Smith".
}
\end{lstlisting}
\begin{itemize}
\item in this query the triple pattern will match against triples whose predicate is the \texttt{family-name} property from the \texttt{vcard} vocabulary whose object is the string \texttt{"Smith"} and whose subject is anything (because \texttt{?person} is just a variable/wildcard)
\item \texttt{SELECT} indicates which values should be listed after the query executes
\end{itemize}

The result of such query would be for example \texttt{emp1, emp2}. Because this does not tell much, let's extend the query. Let's add a second triple pattern that matches on the \texttt{?givenName} (just a wildcard) for everything that matched in the previous query (first line in \texttt{WHERE} statement) and whose predicate is a \texttt{given-name} property from the vcard vocab:
\lstset{breaklines=true,language=SQL,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?person ?givenName
WHERE
{
  ?person vcard:family-name "Smith".
  ?person vcard:given-name ?givenName.
}
\end{lstlisting}
Now the result could look like:
\begin{center}
\begin{tabular}{ll}
?person & ?givenName\\
\hline
emp1 & Heidi\\
emp2 & John\\
\end{tabular}
\end{center}

Let's retrieve the given name, family name and hire date of \emph{all} employees:
\lstset{breaklines=true,language=SQL,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?givenName ?familyName ?hd
WHERE
{
  ?person vcard:given-name ?givenName.
  ?person vcard:family-name ?familyName.
  ?person vcard:hireDate ?hd.
}
\end{lstlisting}
Result:
\begin{center}
\begin{tabular}{llr}
?givenName & ?familyName & ?hd\\
\hline
Jane & Berger & 2019-03-10\\
Francis & Jones & 2019-02-13\\
John & Smith & 2019-01-28\\
Heidi & Smith & 2019-01-13\\
\end{tabular}
\end{center}
To narrow down the above results via some condition we could use filter:
\lstset{breaklines=true,language=SQL,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
PREFIX vcard: <http://www.w3.org/2006/vcard/ns#>

SELECT ?givenName ?familyName ?hd
WHERE
{
  ?person vcard:given-name ?givenName.
  ?person vcard:family-name ?familyName.
  ?person vcard:hireDate ?hd.
  FILTER(?hd < "2019-03-01")
}
\end{lstlisting}
Result:
\begin{center}
\begin{tabular}{llr}
?givenName & ?familyName & ?hd\\
\hline
Francis & Jones & 2019-02-13\\
John & Smith & 2019-01-28\\
Heidi & Smith & 2019-01-13\\
\end{tabular}
\end{center}
Let's say we add another triple pattern \texttt{?person vcard:completedOrientation ?oDate.}. Now only employees who have an \texttt{vcard:completedOrientation} predicate association would be listed. But we still want to show all employees, so in this case the triple pattern should be made optional \texttt{OPTIONAL \{?person vcard:completedOrientation ?oDate.\}}.\\
On the other hand if you want to list every person who has not completed the orientation yet, you would use \texttt{NOT EXISTS \{?person vcard:completedOrientation ?oDate.\}}
