uni/informatik/xml/quickguides.tex
\section{OWL by Erfan}
\label{sec:org525f555}
OWL (Web Ontology Language)
\begin{itemize}
\item Enables (by means of additional vocabulary bound to formal semantics) stronger interpretation possibilities of Web contents such as XML, RDF and RDFS
\end{itemize}

OWL consists of three sub-languages with increasing expressive power: OWL Lite, OWL DL , OWL Full
OWL Lite • Easy to implement and made for simple taxonomies • equivalence, i.e. owl:sameAs • Property characteristics, i.e. owl:InverseOf • Many further aspects: property restrictions, cardinality, intersections
OWL DL • Allows a decidable set of first-order logic OWL Full • Same constructs as in OWL DL, but without restrictions; not decidable statements can also be described. Ontology is undecidable, but it, thus, enables higher order predicate logic
\end{document}
